[
  {
    "id": 1742,
    "author": 3,
    "date": "2023-01-27 00:00:33",
    "title": "The Cuban Guide to Key West",
    "slug": "cuban-key-west-guide",
    "excerpt": "",
    "content": "<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">With only 90 miles separating the two islands, it’s no wonder that the Cuban flavor has been infused into Key West’s laid-back lifestyle. Florida’s backyard paradise has served as a haven for Cuban immigrants for centuries, allowing the <a href=\\\"/key-west-cuba-history/\\\">Cuban culture</a> to seep into the roots of Key West. This guide will showcase the best spots to learn more about the history and sabor de Cuba around the Conch Republic.&nbsp; </span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3><b>Key West's Cuban Heritage</b></h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">The San Carlos Institute is an iconic landmark founded in 1871 by Cuban exiles of Key West as an educational, civic, and patriotic center. Considered to be the cradle of Cuba’s independence movement, this historical building serves as a beacon of hope for many Cuban-Americans. It was there that </span><span style=\\\"font-weight: 400;\\\">José Martí</span><span style=\\\"font-weight: 400;\\\"> united the exiled community to launch the final phase of his campaign for Cuba's independence in 1892. Located on Duval Street, this institute provides the perfect glimpse into the fascinating relationship between Key West and the Cuban community.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1749} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2021/03/key-west-cuban-guide-san-carlos.jpg\\\" alt=\\\"The San Carlos Institute in Key West florida\\\" class=\\\"wp-image-1749\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3><b>Key West Cigar Shops</b></h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\"><strong>The Original Key West Cigar Factory</strong><br>When Cubans originally migrated to Key West, they brought the Havana cigar business with them. These cigar makers imported tobacco leaves from Cuba and started rolling them by hand. Making sure the historical significance of <b><i>The Original Key West Cigar Factory</i></b> didn't pass quietly, it now stands as a historical landmark and wonderful tourist attraction. Drop by Duval Street and explore their incredible line of cigars, hats, and accessories.<br></span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Key West Havana Cigar Company<br><span style=\\\"font-weight: 400;\\\">The tradition of making and enjoying fine hand-rolled cigars has been passed down from generation to generation in Key West. The Key West Havana Cigar Company offers only the finest cigars, providing their customers with a traditional Cuban experience. Located on the historic <a href=\\\"https://www.trolleytours.com/key-west/duval-street\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">Duval Street</a>, the shop’s ambiance is ideal for the cigar aficionado.</span></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1780} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2021/03/key-west-cuban-guide-cigars.jpg\\\" alt=\\\"rolling cuban cigars\\\" class=\\\"wp-image-1780\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3><strong>Explore Cuban History in Key West</strong></h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><strong>Cayo Hueso y Habana<br><span style=\\\"font-weight: 400;\\\">Located in the historic Mallory Square, The Cayo Hueso y Habana Historeum brings some of Cuba’s finest traditions to Key West. Inside the beautiful red brick building you’ll feel as if you’ve been transported back to early Havana. Cuban food, music, art, and spices can all be found within this must stop tourist attraction.</span><br></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1761} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2021/03/key-west-cuban-guide-cayo-huseo-y-habana.jpg\\\" alt=\\\"Cayo Huseo y Habana in Key West Florida\\\" class=\\\"wp-image-1761\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3><strong>Find the Best Cuban Food in Key West</strong></h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><strong>El Meson de Pepe<br><span style=\\\"font-weight: 400;\\\">Located in the popular Old Town neighborhood of Key West and next to Mallory Square, <a href=\\\"/\\\">El Meson de Pepe</a> has been crafting <a href=\\\"/menu\\\">authentic cuban food</a> and drinks for more than 30 years. Enjoy the best mojitos and caipirinhas in paradise and witness the breathtaking Conch Republic sunset by the Patio Bar. This popular Cuban restaurant features classic dishes just like Abuela made them!</span><br></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1756} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2021/03/key-west-cuban-guide-el-meson-de-pepe.jpg\\\" alt=\\\"authentic cuban food at el meson de pepe key west\\\" class=\\\"wp-image-1756\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3><strong>Discover Cuban Cocktails</strong></h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><strong>Paradise Restaurant</strong><br><span style=\\\"font-weight: 400;\\\">Walk down Duval street and you’ll find Paradise Restaurant, a hidden gem serving Cuban, Columbian, and Caribbean food. The fun atmosphere and fully stocked bar makes this cuban restaurant the perfect spot for a late night mojito. Walk in for the delicious food, but stay for the lively and fun ambiance. </span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3><strong>Cuban Coffee</strong></h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\"><strong>Cuban Coffee Queen</strong><br>Ask anybody in the Conch Republic where they can find the best Colada and Café Con Leche in the Conch Republic and you’re bound to hear the Cuban Coffee Queen mentioned once or twice. You can often find the true cafeteros waiting for their fix by the traditional Ventanita. Drop by this Cuban restaurant for a quick coffee or one of their delicious sandwiches and smoothies.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Fisherman’s Cafe<br><span style=\\\"font-weight: 400;\\\">Located on Elizabeth Street, in the Historic Seaport a few blocks away from Mallory Square, this Key West classic features a charmingly nostalgic ambience, cuban coffee, and delicious local cuisine. Serving up island favorites with a modern twist, this walk-up eatery is the rebirth of an old local favorite, where conchs came to swap stories over a morning coffee and catch up on the news of the day. Inspired by cuban food, the menu features a delicious mix of island favorites with traditional Conch Republic ingredients.</span><br></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1755} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2021/03/key-west-cuban-guide-fishermans-cafe.jpg\\\" alt=\\\"cafe con leche at Fisherman's Cafe in key west\\\" class=\\\"wp-image-1755\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>5 Brothers<br><span style=\\\"font-weight: 400;\\\">5 Brothers Grocery and Sandwich Shop is more of a Cuban bodega than Cuban restaurant, but that doesn’t stop people from lining up for their delicious sandwiches. A menu favorite is their Cuban Sandwich y Cafe duo. A delicious shot of authentic cuban coffee with a side of traditional Cuban sabor.&nbsp; Located on Duval Street, it’s easy to see what makes this spot such an island favorite!</span></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Kim's Kuban<br><span style=\\\"font-weight: 400;\\\">Tourists and locals flock to Kim’s Kuban in Key West for delicious Mexican and Cuban food. This family owned latin restaurant features some of the best Cuban breakfast meals and traditional Mexican tacos on the island. Famous for their breakfast menu, this cuban restaurant is guaranteed to start your day the right way. </span><br></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3><strong>Experience Live Cuban Music</strong></h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><strong>Mallory Square + El Meson<br><span style=\\\"font-weight: 400;\\\">Make sure to cap off your day at Mallory Square by experiencing their legendary <a href=\\\"/sunset-celebration-key-west/\\\">sunset celebrations</a>. The </span><i><span style=\\\"font-weight: 400;\\\">Key West Sunset Celebration</span></i> <span style=\\\"font-weight: 400;\\\">invites everyone to partake in watching the glowing pink and red sun sink into the Gulf of Mexico horizon. The nightly festival hosts visitors from all over. Dance the night away to your favorite salsa tunes at El Meson De Pepe, located within <a href=\\\"https://www.mallorysquare.com\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">Mallory Square</a>. Or walk along the scenic attraction, enjoying the magicians, jugglers, clowns, psychics, local musicians, artists, and food vendors that star in this incredible cultural experience.</span></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1753} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2021/03/key-west-cuban-guide-mallory-square-el-meson.jpg\\\" alt=\\\"live music at el meson de pepe in mallory square\\\" class=\\\"wp-image-1753\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>Green Parrot<br><span style=\\\"font-weight: 400;\\\">Voted the best bar in Key West, Green Parrot’s is the place to be for live music in the Conch Republic. This fun and vibrant spot features a fully stocked bar and some of the top local musicians playing live music of all genres. Drop in for a quick drink and you’ll be instantly drawn to the charm and fun of this hidden gem.&nbsp;</span></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1754} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2021/03/key-west-cuban-guide-green-parrot.jpg\\\" alt=\\\"live music at green parrot in key west\\\" class=\\\"wp-image-1754\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>Sunset Pier<br><span style=\\\"font-weight: 400;\\\">There's always an event to enjoy at Sunset Pier. Voted one of the 10 best bars in Key West by </span><span style=\\\"font-weight: 400;\\\">Condé Nast Traveler</span><span style=\\\"font-weight: 400;\\\">, this outdoor spot features live music and the perfect views of the breathtaking sunsets in paradise. One visit to this tropical oasis and it’s clear to see what makes it so special. </span><br></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">As you can see, the roots of the Cuban culture are infused throughout the entire island of Key West. From the delicious flavors to the vibrant music, it’s hard not to feel the influence reverberate around the Conch Republic. Hopefully this guide has painted a clearer picture for you of the Cuban American experience in Key West. </span></p>\n<!-- /wp:paragraph -->",
    "modified": "2023-11-27 22:25:57",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1821,
    "author": 3,
    "date": "2021-07-14 17:00:17",
    "title": "El Meson de Pepe Key West",
    "slug": "el-meson-de-pepe-key-west",
    "excerpt": "",
    "content": "<!-- wp:paragraph -->\n<p>El Meson de Pepe Key West (“El Meson de Pepe Key West”) reaches out to social media users to seek their permission to feature our favorite user content on our website, social channels, and various promotional materials. You are reading this because El Meson de Pepe Key West has requested your permission to use your social media content in this way.<br><br>If you choose to allow us to use your social media content by replying with the hashtag #YesElMeson, you agree to these Terms of Use.<br><br>USER CONTENT LICENSE<br>You hereby grant limited permission to El Meson de Pepe Key West the right to use your content, worldwide, royalty-free for marketing purposes for a 48-month period including but not limited to, on webpages, promotional emails, ads, and social media pages operated by El Meson de Pepe Key West.<br><br>Content that is requested permission to be used by El Meson de Pepe Key West must be by the original creator. You must be the sole owner of the copyright of any photograph(s)/video(s) submitted. Your response using #YesElMeson to our request to use your content is your guarantee that you are the author and copyright holder of the photograph(s)/video(s). El Meson de Pepe Key West will make every attempt to apply proper photograph(s)/video(s) credit when utilizing the content on online &amp; offline promotions. Descriptions or titles, if any, used with the photograph(s)/video(s) are in El Meson de Pepe Key West sole discretion. In the event that ownership of any photograph(s)/video(s) submitted is challenged in any manner by any person, El Meson de Pepe Key West will discontinue the use of the photograph(s)/video(s).<br><br>From time to time El Meson de Pepe Key West likes to promote user content with the public username, real name and/or location to showcase how unique and varied our customer base is. You grant El Meson de Pepe Key West the right to use this public information with the right to use your content.<br><br>You certify that you are at least 18 years of age.<br><br>By participating in the #YesElMeson, you agree to release and hold harmless El Meson de Pepe Key West from and against any claim or cause of action arising out of participation in the #YesElMeson.<br><br>El Meson de Pepe Key West usage of user content by permission of #YesElMeson is in no way sponsored, administered or associated with the following social media networks: Facebook, Twitter, Instagram and Pinterest. By providing a response of #YesElMeson to El Meson de Pepe Key West to use your content, you release Facebook, Twitter, Instagram and Pinterest of responsibility and agree to the terms of use of the aforementioned social media networks.<br><br>El Meson de Pepe Key West reserves the right to alter these Terms of Use by posting a revised Terms of Use. Accordingly, you should review the Terms of Use each time you grant permission or authorization to feature your content.<br><br>El Meson de Pepe Key West reserves the right to remove any user content from their website, marketing, etc. at any time.</p>\n<!-- /wp:paragraph -->",
    "modified": "2021-07-15 14:13:35",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1541,
    "author": 7,
    "date": "2018-07-19 20:12:16",
    "title": "Best Places To Watch The Sunset in Key West",
    "slug": "key-west-sunset",
    "excerpt": "",
    "content": "Okay, amigos! If you’re looking for the perfect spot to watch the sunset here in Cayo Hueso, then we’ve got you covered. Although Key West’s famous sunset can be experienced from pretty much anywhere on the island, there are a few places where it’s absolutely maravilloso! From venues rich in history to others with lively entertainment, here are the very best places to watch the sunset in Key West.\n<h2>Mallory Square</h2>\n<a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2016/02/mallory-square-sunset-celebration.jpg\\\"><img class=\\\"alignnone size-full wp-image-1164\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2016/02/mallory-square-sunset-celebration.jpg\\\" alt=\\\"Mallory Square Sunset Celebration\\\" width=\\\"850\\\" height=\\\"500\\\"></a>\nIn the mood for a fiery fiesta?! If it’s a bit of a party you’re looking for, then head on over to Mallory Square. For decades, Mallory Square has been the home of Key West’s famous <a href=\\\"https://www.mallorysquare.com/sunset-celebration/\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">Sunset Celebration</a> - a nightly festival where locals and tourists alike gather to watch the sun set into the horizon. Two hours prior to sunset, local artists, street performers, and food vendors come together to put on quite a show. From magicians to sword swallowers, we think it’s safe to say there’s enough entertainment to go around! It’s the perfect place to let loose, have some fun, and say adios to another day in paradise!\n<h2>El Meson de Pepe</h2>\n<a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/07/key-west-el-meson-de-pepe-restaurants-outdoors.jpg\\\"><img class=\\\"alignnone size-full wp-image-1543\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/07/key-west-el-meson-de-pepe-restaurants-outdoors.jpg\\\" alt=\\\"El Meson de Pepe Outdoors\\\" width=\\\"850\\\" height=\\\"500\\\"></a>\nWe may be a little biased, but our restaurant is exactly where you want to be at sunset! One of <a href=\\\"https://www.elmesondepepe.com/\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">Mallory Square's restaurants</a>, El Meson de Pepe is the perfect spot to sit back, relax, and watch the sunset while enjoying<a href=\\\"https://www.elmesondepepe.com/ultimate-cuban-sandwich/\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\"> authentic cuban food</a>, tapas, and drinks. Beautiful views AND Key West’s very best mojitos? You can’t really beat that. We’ve got live music that’ll have you dancing in no time and plenty of traditional Cuban entrees that’ll keep you full and satisfied while you continue your eventful night on the island.\n<h2>Historic Seaport</h2>\nThe <a href=\\\"https://www.elmesondepepe.com/things-to-do-mallory-square-key-west/\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">historic seaport</a> is another favorite location to take in Key West’s gorgeous sunset. Enjoy a nice stroll on the boardwalk with beautiful pink and gold skies all around as the sun glistens on the horizon. Check out boats of all sizes at the docks and then grab a seat at one of the many open-air bars and restaurants where they serve fresh seafood that we hear is delicious! It’s a great place to hang out with friends and wind down from the day while enjoying some picturesque harbor views.\n<h2>Sunset Pier</h2>\nFor another beautiful view of Key West and its stunning sunset, make your way over to Sunset Pier. Located at the end of Duval Street at Ocean Key Resort &amp; Spa, this vibrant pier is a paradise of its own. It’s a great place to relax, have a drink, and grab something to eat at the Tiki Bar &amp; Grill. Plus there’s <a href=\\\"https://www.elmesondepepe.com/key-west-live-music-restaurants/\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">nightly music and dancing</a> - both of which you can enjoy while watching the sun set into Key West Harbor.\n<h2>Fort Zachary Taylor State Park</h2>\n<a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/07/fort-zachary-sunset.jpg\\\"><img class=\\\"alignnone size-full wp-image-1547\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/07/fort-zachary-sunset.jpg\\\" alt=\\\"Fort Zachary Sunset\\\" width=\\\"850\\\" height=\\\"500\\\"></a>\nAnother great place to watch the sunset that’s also rich in history is Fort Zachary Taylor State Park. The Civil War era fort marks the entrance to Key West Harbor, and its beachfront grounds are exactly where you want to be when the sun touches down on the horizon. Remote and full of so much natural beauty, it’s a picture perfect location to sit quietly on the beach while enjoying the setting sun.\n<h2>Fury Sunset Sail</h2>\n<a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/07/fury-water-adventures-sunset-sail.jpg\\\"><img class=\\\"alignnone size-full wp-image-1546\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/07/fury-water-adventures-sunset-sail.jpg\\\" alt=\\\"Fury Water Adventures Sunset Sail\\\" width=\\\"850\\\" height=\\\"500\\\"></a>\nFinally, you can’t leave Key West without catching a sunset out on the water and there’s no better way to do that than aboard Fury’s Commotion on the Ocean. This <a href=\\\"https://www.furycat.com/key-west/sunset-sailing-cruises\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">live music sunset sail</a> is one of the most memorable ways to experience the sunset, lounging on a spacious catamaran while listening to some tunes. Get up and dance or sit back and watch; but regardless, enjoy complimentary drinks and appetizers while feeling the warm ocean breeze around you.\n\nSo there you go! Some of the best places to watch the <a href=\\\"https://www.elmesondepepe.com/sunset-celebration-key-west/\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">sunset in Key West</a>! Again, you can’t go wrong just about anywhere on the island, but these are certainly some of our favorites.",
    "modified": "2021-01-22 16:26:07",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1515,
    "author": 7,
    "date": "2018-06-13 20:40:16",
    "title": "Finding The Best Tapas In Key West",
    "slug": "best-tapas-in-key-west",
    "excerpt": "",
    "content": "<!-- wp:image {\\\"id\\\":1531} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/06/el-meson-de-pepe-restaurant-appetizer-with-beer.jpg\\\" alt=\\\"Appetizer of loaded nachos paired with a cold beer at El Meson de Pepe\\\" class=\\\"wp-image-1531\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:heading -->\n<h2>Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:heading -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<!-- wp:heading -->\n<h2>Little Plates, Big Taste</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">According to legend (and varying from one Spanish region to another), the etymology of the word ‘tapas’ is owed to <a href=\\\"/menu/\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">small plates of food</a> that arrive at the diner’s table balanced on top of a glass of wine or beer. ‘Tapa’ means ‘top’, you see. Another variant states that patrons would put their empty plates or bar napkins over their drink to avoid an unwanted bug from falling inside. Either way, the translation remains the same. What doesn’t remain the same, however, is the parade of plates that come and go on a typical tapas crawl in Spain’s capital, Madrid. That’s where these bad boys originate and it is a philosophy of dining that celebrates variety and makes eating almost an interactive sport.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For one, only a fool would stay in any one tapas bar for more than 20 minutes. The idea here is to go foraging, in a way, for your next meal at the next bar down the road. Of course, <a href=\\\"https://www.elmesondepepe.com/best-bars-in-key-west/\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">this crawl</a> is meant to be done with a group of over-exuberant friends just as hungry for good company as for the local anchovies swimming in golden extra virgin olive oil. If one were to analyze the custom honestly, it can be argued that the actual tapas are secondary to the drinking of alcohol, notably Cava, a ubiquitous Champagne-like sparkling wine that flows liberally at these establishments. The entire ritual, if one can call it that, is a beautiful thing --- friends, travel, exploration, booze and really, really good food. Add to all this that the tapas are on the house so long as you continue to imbibe and you’re talking about something the whole world should support. Having dinner at 11pm, though, may not catch on quite as much. But that’s a topic for another time.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1520,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<figure class=\\\"wp-block-image\\\"><a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/06/el-meson-de-pepe-tapas-plate-with-tropical-drink.jpg\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/06/el-meson-de-pepe-tapas-plate-with-tropical-drink.jpg\\\" alt=\\\"antojitos with sangria at el meson de pepe key west\\\" class=\\\"wp-image-1520\\\"/></a></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>A track by track listing of the Tapas Greatest Hits, would go a little something like this: Spanish olives, pit in place, served simply in their own oil. Meatballs snuggled together in an earthenware bowl covered in tomato sauce sprinkled with saffron and almond slivers. The revered jamon Serrano, ham derived from a princely pig, cured and glistening, served with crusty bread. Grilled marinated octopus. Plump croquettes and a dish full of gamesmanship, Padron peppers. The aforementioned flavor bombs are blistered in a hot, cast iron pan with oil then served with a sprinkling of salt. The element of surprise that makes these a standout is not knowing which ones are mild and which will have you sweating through your eyeballs. Now that’s a real bar snack!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Eventually, tapas evolved from a regional food from a particular European country to something different here in the States. This is not to say you can’t find a suitable <a href=\\\"https://www.elmesondepepe.com/key-west-cuba-history/\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">Spanish tavern</a> here were you can eat patatas bravas while taking in a flamenco floor show. There are plenty of those. It’s what you find on the plate itself that has evolved. Today, tapas are pretty much anything served on a small plate intended to be shared. They come in a multitude of flavor profiles, colors and shapes and many restaurateurs and executive chefs are putting them on their menus in one form or another.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Tapas With A Key West Twist</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>For a taste of modern day tapas in Key West, grab a seat at El Meson de Pepe in historic <a href=\\\"https://www.elmesondepepe.com/sunset-celebration-key-west/\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">Mallory Square</a> and surrender to the smells of of our savory <a href=\\\"https://www.elmesondepepe.com/traditional-cuban-cuisine/\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">Cuban dishes</a>. If you want to take your palette to places it’s never been before, order one of everything! If you are a person that bores easily, tapas-style eating will be your new favorite thing. Nothing against a nice, grilled, medium rare skirt steak or a luscious slice of Lasagna Bolognese, but that meal will never get better than the first bite, whereas with tapas… you’re ready to go on a different culinary adventure with every plate. Vive la difference!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1518,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<figure class=\\\"wp-block-image\\\"><a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/06/el-meson-de-pepe-tapas-plate.jpg\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/06/el-meson-de-pepe-tapas-plate.jpg\\\" alt=\\\"guacamole on loaded nachos aerial view at el meson de pepe\\\" class=\\\"wp-image-1518\\\"/></a></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>If you can’t order one of everything, definitely start with the official dish of Key West. Conch fritters! That’s ‘conch’ as in ‘honk’ and they’re out of this world! A conch, for those of you from landlocked areas and points north, is a mollusk, like clams and oysters, that lives in one of those giant shells you put up to your ear to hear the ocean. Grab one of those spongy hush puppies of the sea, douse it with a little hot sauce and a spritz of lime and you are good to go. Next up, Cuban-style tamales steamed in corn husk. Finely ground corn is kneaded into a dough called masa, filled with roast pork then wrapped and gently steamed. Marinated cubed pork and golden fried Picadillo (ground beef) &amp; pork stuffed fried potato balls served with chipotle key lime sauce. A Cuban riff on nachos that opts for deep-fried slices of plantain as the vehicle for dipping that's topped with ropa vieja (shredded, stewed beef), picadillo, guacamole, cheese, diced tomatoes, and onions and they even pay homage to traditional Spanish tapas with Vieiras Al Ajillo (sauteed scallops in garlic) and a plate of head-on, grilled shrimp known as Gambas A La Plancha.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>So now you know all there is to know about tapas and <a href=\\\"http://www.elmesondepepe.com\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">where to find the best in Key West</a>. If you can’t finish all those tapas you ordered at El Meson de Pepe, just take the rest home with you. They’re great for breakfast too!</p>\n<!-- /wp:paragraph -->",
    "modified": "2022-03-17 15:42:19",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1492,
    "author": 3,
    "date": "2018-01-17 14:58:28",
    "title": "Best Restaurants in Key West with Live Music",
    "slug": "key-west-live-music-restaurants",
    "excerpt": "",
    "content": "<span style=\\\"font-weight: 400;\\\">The beautiful thing about Key West is that almost every bar is also a restaurant serving delicious food—and, at almost all of these establishments, there’s live music rocking and rolling day and night. If you’re looking for a hearty meal, a cold drink and a band that will keep your feet tapping and a smile on your face, you’re in luck! These are the best restaurants in </span><a href=\\\"https://www.elmesondepepe.com/sunset-celebration-key-west/\\\"><span style=\\\"font-weight: 400;\\\">Key West</span></a><span style=\\\"font-weight: 400;\\\"> with live music.</span>\n<h3><span style=\\\"font-weight: 400;\\\">El Meson de Pepe</span></h3>\n<span style=\\\"font-weight: 400;\\\">For an </span><a href=\\\"https://www.elmesondepepe.com/\\\"><span style=\\\"font-weight: 400;\\\">authentic Cuban meal</span></a><span style=\\\"font-weight: 400;\\\"> steps away from the waterfront, look no further than family-owned and operated El Meson de Pepe. Enjoy ropa vieja with plantains, rice and black beans along with a frosty mojito at sunset and listen to the beautiful melodies of a live salsa band. It’s the best way to enjoy Key West’s famous Sunset Celebration on Mallory Square in style—and with great food!</span>\n\n<a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/01/meson-music.jpg\\\"><img class=\\\"aligncenter wp-image-1495 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2018/01/meson-music.jpg\\\" alt=\\\"Couple dancing in front of live music\\\" width=\\\"850\\\" height=\\\"500\\\" /></a>\n<h3><span style=\\\"font-weight: 400;\\\">Sloppy Joe’s</span></h3>\n<span style=\\\"font-weight: 400;\\\">There’s a reason Sloppy Joe’s is Key West’s most iconic bar and restaurant. Live music, from country and western to rock ‘n roll, takes center stage from noon to late night every day—and there’s a great menu of food and drinks. This is the place to enjoy the namesake Original Sloppy Joe sandwich made with ground beef in a rich tomato sauce with onions, peppers and spices. Other highlights include the South Carolina pulled pork BBQ sandwich, blackened fish sandwich, a delicious cheeseburger and a wide variety of pizzas.</span>\n\n<span style=\\\"font-weight: 400;\\\"><a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/02/key-west-sloppy-joes.jpg\\\"><img class=\\\"aligncenter wp-image-1295 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/02/key-west-sloppy-joes.jpg\\\" alt=\\\"Sloppy Joe's Bar in Key West\\\" width=\\\"850\\\" height=\\\"500\\\" /></a></span>\n<h3><span style=\\\"font-weight: 400;\\\">Smokin’ Tuna Saloon</span></h3>\n<span style=\\\"font-weight: 400;\\\">Smokin’ Tuna Saloon is the official host of the Key West Songwriters Festival in May and the unofficial bar to hear great live music year round. Look for acts like Scott Kirby with Caffeine Carl and other regulars to keep the party grooving. You can indulge in delicious dishes like the namesake smokin’ tuna dip, which is not to be missed, and everything from conch fritters to oysters on the half shell and a juicy burger.</span>\n<h3><span style=\\\"font-weight: 400;\\\">Hog’s Breath</span></h3>\n<span style=\\\"font-weight: 400;\\\">As their slogan goes, “Hog’s Breath is better than no breath at all.” This funky open-air bar and restaurant is always buzzing with live music by local and visiting singer-songwriters, drawing a fun crowd. They serve a great bar food menu with exactly what you’re hankering for at such an establishment. Go for the Hog Dog with chili and cheese and a Planters rum punch. You’ll definitely be back for more.</span>\n<h3><span style=\\\"font-weight: 400;\\\">Durty Harry’s</span></h3>\n<span style=\\\"font-weight: 400;\\\">Located in the rear of the Rick’s entertainment complex, Durty Harry’s is where you go when you want to rock out to a live band in a concert-like venue. When you get hungry, head to the pizza window near the Tree Bar for a slice or two of their signature pie. Ask for a bottle of hot sauce and douse your slice just like the locals do. </span>\n<h3><span style=\\\"font-weight: 400;\\\">Sunset Pier</span></h3>\n<span style=\\\"font-weight: 400;\\\">One of the most picturesque places to enjoy live music and a great meal is Sunset Pier at Ocean Key House overlooking the Key West Channel. Snag a pastel bench on the dock overlooking the water for unobstructed views of the sunset, while their crooners sing everything from Motown to trop rock. Order a pina colada and fish tacos or the lobster roll and soak in the good vibes.</span>\n<h3><span style=\\\"font-weight: 400;\\\">Margaritaville</span></h3>\n<span style=\\\"font-weight: 400;\\\">Of course, a trip to Key West is incomplete without “wasting away again in Margaritaville.” Jimmy Buffett’s famous restaurant is the perfect place to indulge in that “Cheeseburger in Paradise” along with a margarita, of course. Enjoy live music day and night, and hop over to the souvenir shop to bring a little piece of Parrothead paradise home with you.</span>\n<h3><span style=\\\"font-weight: 400;\\\">Irish Kevin’s</span></h3>\n<span style=\\\"font-weight: 400;\\\">Irish Kevin’s offers more than just live music. They’ve got a whole host of guitar-clad entertainers who interact with the crowd, tell jokes and keep the energy lively, day and night. They’ve also got a nice pub grub menu to go with their stellar craft beer lineup, which includes quesadillas, soft pretzels and a Cuban mix sandwich.</span>",
    "modified": "2020-05-08 19:30:21",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1452,
    "author": 3,
    "date": "2017-10-30 20:01:59",
    "title": "Best Family-Friendly Restaurants in Key West",
    "slug": "family-friendly-restaurants",
    "excerpt": "",
    "content": "<span style=\\\"font-weight: 400;\\\">When it comes to dining with family in Key West, it’s important to keep a few things in mind. First, you want to go to a restaurant where the kids can spread out, get comfortable and have fun. You’ll also want a spot with a great menu featuring a wide variety of flavors for picky eaters. And, of course, you don’t want to break the bank. We’ve narrowed down the best family-friendly restaurants in Key West for your dining enjoyment.</span>\n<h3><span style=\\\"font-weight: 400;\\\">El Meson de Pepe -&nbsp;410 Wall St</span></h3>\n<span style=\\\"font-weight: 400;\\\">Set in iconic Mallory Square where the <a href=\\\"https://www.elmesondepepe.com/sunset-celebration-key-west/\\\">Sunset Celebration</a> is held nightly, El Meson de Pepe is an authentic, family-owned Cuban restaurant with a great view. Enjoy the sunset with the family and then grab a table on the patio at El Meson de Pepe where you’ll be serenaded by live music. Grown ups should definitely order a round of mojitos. <a href=\\\"https://www.elmesondepepe.com/menu/\\\">From ropa vieja to the Cayo Hueso Cuban Mix sandwich</a> with plantains, rice and beans, there are so many delicious flavors to indulge in. There’s even a kids’ menu serving more familiar fare like burgers and chicken fingers with fries.</span>\n\n<a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2016/09/el-meson-de-pepe.jpg\\\"><img class=\\\"aligncenter wp-image-1211 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2016/09/el-meson-de-pepe.jpg\\\" alt=\\\"View from inside El Meson De Pepe\\\" width=\\\"850\\\" height=\\\"500\\\"></a>\n<h3><span style=\\\"font-weight: 400;\\\">Fogarty’s -&nbsp;<span class=\\\"_xdb\\\">&nbsp;</span><span class=\\\"_Xbe\\\">227 Duval St</span></span></h3>\n<span style=\\\"font-weight: 400;\\\">With an expansive patio in the heart of Duval Street, Fogarty’s is an easy place to pull off a family meal. There’s plenty of room for kids to fan out, portions are generous and menu options are plentiful. Some of their classic dishes include chicken broccolini pasta, the shrimp &amp; bacon club and tex-mex eggrolls. There’s also a wide selection of salads and sandwiches, including a delicious juicy cheeseburger. For the grownups in your party, Fogarty’s has one of the widest selections of frozen drinks on the island.</span>\n<h3><span style=\\\"font-weight: 400;\\\">Conch Republic Seafood Company -&nbsp;631 Greene St</span></h3>\n<span style=\\\"font-weight: 400;\\\">Located on the Historic Seaport, the Conch Republic Seafood Company is a salty, open-air waterfront restaurant with lots of character. There’s a wrap-around bar with a giant aquarium in the center of the restaurant and live music at happy hour. Grab a table in the spacious dining room and order up all the classic Key West seafood dishes you’re craving including conch fritters, conch chowder, mahi sandwiches and key lime pie. They’ve got it all in just the right setting! </span>\n<h3><span style=\\\"font-weight: 400;\\\">Bad Boy Burrito -&nbsp;1128 Simonton St</span></h3>\n<span style=\\\"font-weight: 400;\\\">For an easy, casual meal on-the-go, stop by Bad Boy Burrito adjacent to the Bottle Cap. You’ll order at the counter and build your own organic burrito with delicious fresh ingredients, sauces and toppings or you can select from their menu of tacos, salads and smoothies. There’s plenty of seating on the shaded patio to enjoy a delicious lunch. </span>\n<h3><span style=\\\"font-weight: 400;\\\">Fisherman’s Café -&nbsp;205 Elizabeth St</span></h3>\n<span style=\\\"font-weight: 400;\\\">Fisherman’s Café is a <a href=\\\"https://www.elmesondepepe.com/cuban-coffee-key-west/\\\">casual breakfast</a> and lunch counter near the Historic Seaport, a nostalgic café dedicated to the flavors of Old Key West and Cuba. Whether it’s a Cubano breakfast sandwich made with eggs, pork shoulder and chorizo or a blackened shrimp club wrap for lunch, the flavors really deliver. Order up and then walk over to the docks to enjoy your lunch with a view.</span>\n\n<span style=\\\"font-weight: 400;\\\"><a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/10/fishermans-cafe.jpg\\\"><img class=\\\"aligncenter wp-image-1465 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/10/fishermans-cafe.jpg\\\" alt=\\\"Open sandwich from Fishermans Cafe\\\" width=\\\"850\\\" height=\\\"500\\\"></a></span>\n<h3><span style=\\\"font-weight: 400;\\\">Blue Heaven -&nbsp;729 Thomas St</span></h3>\n<span style=\\\"font-weight: 400;\\\">Blue Heaven is easily Key West’s most iconic restaurant. Tucked away in Bahama Village, you’ll understand the name as soon as you set foot in this subtropical backyard shaded by palm trees and ship sails with pastel-painted wooden furniture. It’s truly heaven on earth. It’s a classic breakfast destination with its surf &amp; turf eggs benedict, but it’s also a great destination for any meal of the day with delicious dishes like jerk chicken and lots of vegetarian options. For kids, there’s plenty of space to run around and there’s even a ping-pong table.</span>\n<h3><span style=\\\"font-weight: 400;\\\">Margaritaville -&nbsp;500 Duval St</span></h3>\n<span style=\\\"font-weight: 400;\\\">Jimmy Buffett’s Margaritaville is a classic restaurant to melt into the Key West state of mind. With Buffett songs on the speakers, as well as live musicians, it’s a fun place to enjoy a cheeseburger in paradise with the family. Grown ups: definitely <a href=\\\"https://www.elmesondepepe.com/best-bars-in-key-west/\\\">order a round of margaritas</a> here! There’s also a souvenir shop on site for any serious Parrot Heads in your party who want to scoop up a t-shirt.</span>",
    "modified": "2021-01-22 16:28:15",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1446,
    "author": 3,
    "date": "2017-10-30 19:26:12",
    "title": "Best Local Foods to Try in Key West",
    "slug": "key-west-local-food-secrets",
    "excerpt": "",
    "content": "<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">If you’re visiting Key West, there’s a wealth of food that you just don’t see regularly off the island. From a bounty of freshly caught seafood to the sweet and tart key lime pie, here’s a guide to the best of <a href=\\\"https://www.elmesondepepe.com/key-west-blog/\\\">Key West’s local foods</a>. </span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Key lime pie</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">Perhaps no food is more strongly tied to Key West than <a href=\\\"https://www.elmesondepepe.com/best-dessert-key-west/\\\">key lime pie</a>. While key limes are no longer widely harvested in Florida, the key lime pie lives on in the Florida Keys, where bakers source the bittersweet, highly acidic citrus fruit from Mexico or the West Indies. Look for the tart-creamy pie on dessert menus across the island and inquire about whether a pastry chef is onsite to gauge the freshness and authenticity of the pie they’re slinging. We can vouch for Blue Heaven where it’s baked fresh daily and topped with mile-high meringue. For key lime pie on the go, swing by Kermit’s for every variety under the sun, including frozen on a stick and dipped in chocolate. It’s divine!</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"align\\\":\\\"center\\\",\\\"id\\\":1288,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<div class=\\\"wp-block-image\\\"><figure class=\\\"aligncenter\\\"><a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/02/kermits-key-lime-pie-key-west.jpg\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/02/kermits-key-lime-pie-key-west.jpg\\\" alt=\\\"Man holding pie in front of Kermits Key West Key Lime Shoppe\\\" class=\\\"wp-image-1288\\\"/></a></figure></div>\n<!-- /wp:image -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Conch Fritters</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">Conch fritters are another Key West delicacy. Made from the tough, meaty mollusk found inside the beautiful pink, spiraling conch shells that you see in souvenir stores, they’re plucked from the ocean floor throughout the Keys. They’re actually protected in the state of Florida now, so all the conch you consume in Key West is either farmed or from the Bahamas. It’s best enjoyed fried up like hush puppies in fritter form and can be found on bar menus throughout the island. We’re big fans of the conch fritters at the Conch Republic Seafood Company at the Historic Seaport and from the stand at Mallory Square during the <a href=\\\"https://www.elmesondepepe.com/sunset-celebration-key-west/\\\">Sunset Celebration</a>.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Conch Chowder</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">This is another classic way to enjoy conch in Key West. Typically prepared in a spicy tomato broth with potatoes and vegetables, conch chowder is a comforting staple. Just like the fritters, we enjoy a bowl of conch chowder at the Conch Republic Seafood Company. </span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Authentic Cuban food</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">Key West is only 90 miles from Cuba, as it’s famously displayed on the Southernmost Buoy—that’s closer than mainland Miami. The Cuban – Key West connection runs deep, making the island home to some of the most authentic Cuban food this side of Havana. At El Meson de Pepe, you can enjoy this savory, hearty fare in a beautiful setting on Mallory Square. From </span><i><span style=\\\"font-weight: 400;\\\">ropa vieja</span></i><span style=\\\"font-weight: 400;\\\"> (stewed shredded beef) to </span><i><span style=\\\"font-weight: 400;\\\">camarones al ajillo </span></i><span style=\\\"font-weight: 400;\\\">(sautéed garlic shrimp) all served with yellow rice, black beans, and sweet plantains, it’s a cuisine that’s hard to resist. Of course, <a href=\\\"https://www.elmesondepepe.com/ultimate-cuban-sandwich/\\\">the classic Cuban mix sandwich</a> is also a favorite: sugar glazed ham, roast pork, Swiss cheese, pickles, and mustard pressed on crusty Cuban bread. And don’t forget a strong and sweet café con leche for an extra kick.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"align\\\":\\\"center\\\",\\\"id\\\":1105} -->\n<div class=\\\"wp-block-image\\\"><figure class=\\\"aligncenter\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-rice-beans-plantains.jpg\\\" alt=\\\"El Meson Rice Beans and Plantains\\\" class=\\\"wp-image-1105\\\"/></figure></div>\n<!-- /wp:image -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Coconut water</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">While coconut water might be all the rage amongst fitness fanatics around the country as a naturally nutrient-rich way to hydrate, we’ve been cracking coconuts in Key West and sticking straws in them for years. The mildly sweet water is an acquired taste for some and absolutely addictive for others. Grab a fresh coconut from the Southernmost Deli &amp; Grocery near Simonton Street or buy the water pre-bottled from the health café Help Yourself.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Fresh caught fish sandwich</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">When you’re talking about local food in Key West, you’re invariably talking about freshly caught local fish, and one of the best ways to enjoy the fruits of the sea is on a sandwich. We’re talking grouper, mahi, snapper and sometimes even conch, grilled, blackened or fried with a squeeze of lemon sandwiched between a toasty roll, maybe with a smear of tartar sauce. Delicious! BO’s Fish Wagon is the classic destination for a fish sandwich and we’re also big fans of Pepe’s just across the street.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Key West pink shrimp</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">While we’re talking seafood, let’s move onto Key West pinks, shrimp caught locally in the waters offshore Key West. Whether they’re served as peel ‘n eats and steamed by the bucketful at places like Alonzo’s or Half Shell Raw Bar, or prepared in a savory club sandwich with bacon and Swiss cheese-like at Jack Flats, these delicious crustaceans are must eats while in Key West.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"align\\\":\\\"center\\\",\\\"id\\\":1470,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<div class=\\\"wp-block-image\\\"><figure class=\\\"aligncenter\\\"><a href=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/10/half-shell.jpg\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/10/half-shell.jpg\\\" alt=\\\"Half Shell Raw Bar in Key West\\\" class=\\\"wp-image-1470\\\"/></a></figure></div>\n<!-- /wp:image -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Spiny lobster</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">And that brings us to the mack daddy of all local <a href=\\\"https://fishermanscafekeywest.com\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">Key West seafood</a>, the spiny lobster. Different from the varieties you find in Maine, the Key West spiny lobster has antennas instead of claws, but their tails are just as delicious and slightly sweeter than their northern counterpart. You’ll find them served classically with drawn butter or as one half of a surf ‘n turf entrée on fine dining menus throughout the island. Blue Heaven makes use of them at brunch time with a decadent lobster eggs benedict that’s definitely worth the splurge.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\\\"level\\\":3} -->\n<h3>Key West Legal Rum</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">While Key West is certainly a drinking town with many beverages associated with it (margaritas, mojitos, piña coladas, martinis, beer, rum punch, the list goes on and on…), you can actually taste the first legally distilled rum produced on the island, created by chef Paul Menta onsite at his distillery. <a href=\\\"https://www.elmesondepepe.com/bacardi-rum-history/\\\">The rum</a> is found on cocktail menus throughout the island and you can buy it by the bottle to bring a taste of Key West home with you.</span></p>\n<!-- /wp:paragraph -->",
    "modified": "2022-03-17 15:49:51",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1325,
    "author": 3,
    "date": "2017-05-05 20:08:59",
    "title": "Ultimate Guide To The History of Havana",
    "slug": "history-of-havana-cuba",
    "excerpt": "",
    "content": "Stories of old world charm, socialist regimes, diehard revolutionaries, salsa dancing, and coffee are only some that add to the lure of Cuba. For over five decades, the trade embargo made it extraordinarily difficult for Americans to put ‘travel to Cuba’ on their bucket lists. Now, things are different. The recent entry relaxation and beginnings of the diplomatic conversation between Cuba and the US have opened the floodgates and made Cuba more of a reality than a dream. Although it’s still not extremely easy to get there, more and more travelers are doing their best to see the real Havana.\n<!--more-->\n\nImbedded in the land of juxtaposition is socialism on a shoestring, a stodgy bureaucracy, bohemian bars, unique and captivating characters and enchanting cities with twists and turns along each of their narrow streets. Every street has a story to tell. Whether it’s one of grandeur or hardship, colonialism or revolutionary change – history hits the heels of every traveler as they take their first steps amidst the magic that is Havana.\n\nLocated only <a href=\\\"https://www.elmesondepepe.com/key-west-cuba-history/\\\">90 miles off the coast of Key West, Florida</a> – the largest island nation of Cuba has reawakened as a travel destination for Americans. Today, home to approximately 2.5 million residents, Havana is a city of which to take notice. Divided into diverse municipalities, each with its own charm and unique neighborhood flair, many still head to Havana to see the dichotomy of old world tradition smacked face to face with new age art deco.\n\n<img class=\\\"alignnone wp-image-1329 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/05/el-meson-de-pepe-history.jpg\\\" alt=\\\"Decorated wall inside of El Meson De Pepe\\\" width=\\\"850\\\" height=\\\"500\\\">\n<h3>History</h3>\nCuban history is filled with intrigue. The haves vs. the have-nots, government vs. the citizens, those seeking independence vs. those who want to keep life the way it is, and so many in between are all showcased in this southern island nation. Here the past is always intertwined with the present. New life and adventure flow through the streets where domino players set up shop next to their hanging washing lines.\n\nLike many island nations, the success of the city has always stood on the shoulders of its harbor – the largest natural port in the Caribbean. The original settlement of San Cristobal de la Habana was founded on St. Christopher’s Day in July of 1515 and slightly more than four years later was relocated to the city of the bay of Bahia de la Habana. Not surprisingly, the ports and bridges provided access as the early settlements sprung to life on the strength of the waterfront. The channel opening Cuba through to the Bahamas put Havana on the map! As the waterway access continued, it acted as a link between Spain and the New World and helped to establish trade routes from here to beyond.\n\nThroughout the era when the Spanish conquistadors rummaged through the early Americas, Havana was the meeting place for the Spanish fleet before their voyage back across the Atlantic Ocean. Catering to the influx of seamen, sailors and the lot, the city rose to life with brothels, inns and gambling houses opening up along the ports and giving way to the possibility of attacks by pirates and their mates.\n\nIn the 1500s, Havana became the only Cuban port authorized for commerce, thereby giving Spain the opportunity for fort construction for years. After continuing to build up their forts for the next century, another full century later saw a protective wall spring up around the entire city. By the late 1700s, Havana was taken over by the British. With the boom of wealthy Spanish sugar, Havana’s new age of affluence, prosperity and financial wealth was born.\n\nHavana’s growth period came during the 19th century with beautiful buildings springing up everywhere with new age elegance coming anew. With the boom of buildings came the arrival of crime, corruption and the fleeing of city-dwellers to begin the suburban culture of Cuba. The 20th century brought tourism and towers, hotels and hot places and the tourist industry exploded. ‘Gangsters’ came to town seeking to make Havana the Las Vegas of the Caribbean.\n\nThe Revolution of the 1960s rid the roads of crime and prostitution but began the onslaught of the socialist regime. Many of the wealthy fled north to the United States and left the management and life among the normal neighborhoods in ruins. Countryside life improved while city life began to crumble. Overcrowding was prominent and Fidel Castro’s leadership took hold. Since the 1990s, life has been slowly but steadily improving – but socialism/communism still hold a tight reign.\n\nNeighborhoods and districts divide the city of Havana. Each with its own distinct character and flair, some invite tourists while others are home to mostly locals. There’s Habana Vieja of the harbourside, the old city of Havana and the capital’s tourist center. There’s the gritty Centro Habana, the oceanfront promenade of the Malecón, and Vedado at the heart of the city’s entertainment. Plaza de la Revolucion houses monuments to two of the country’s greatest icons of the struggle for independence (Che Guevara and Jose Marti), while modeled after Miami. Miramar is a hot spot for sophisticated restaurants and music venues all around.\n\nToday, the whole of Havana lives again. Prosperity is evident every which way you look. Restaurants are full, housing is better, and citizens ride right along next to the classics of yesteryear; there are even new cars on the roads. Addressing the inequalities, improvements in the infrastructure of travel and financial investments in the social development of the country and its people have led to a revitalized strength in the Cuban people.\n<h3>Getting To Cuba</h3>\nNew advisories are constantly issued and travel rules are changing often. Regardless of the instantaneous nature of the digital transfer of information, Cuba is still open for business. Some travel tips are important of which to take note. Be sure to have all of your travel documents printed prior to leaving the US. Purchase travel insurance, take out extra cash or even get some in British pounds or Euros as they’re more easily exchanged (you may have difficulty with your ATM cards or US based credit cards).\n\nCheck your visa category – only very few are welcomed with easy access. With approximately $50, Americans can get visas from the Cuban embassy in Washington DC (be sure to apply with the appropriate time necessary prior to your journey). Once your valid ‘tourist card’ is in hand, you’re free to roam the country. Check your chosen airline’s ‘Cuba travel’ page to see exactly where your favorite carrier can take you, how you can get there and when is the best time to travel. Upon arrival, your tourist card will be stamped so your passport does not give you any issue upon return to the US.\n\nIf travel to Cuba is your destination, take note of the weather and climate. November to March is the coolest, driest and busiest. May and June are wet, July through November is hurricane season while August through October can see the peak of hurricanes as they enter their most forceful period.\n\n<img class=\\\"alignnone wp-image-1211 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2016/09/el-meson-de-pepe.jpg\\\" alt=\\\"Image of Indoor Dining Area\\\" width=\\\"850\\\" height=\\\"500\\\">\n<h3>Top 5 Attractions</h3>\nHavana is flooded with attractions, character and the good kind of chaos. Winding streets, whimsical music, decadent coffee, gorgeous seaside and old world meeting the new is ever present every which way you turn. Plan your visit, leave room for spontaneity, put on your favorite dancing shoes and don’t forget to eat – you’re ready for your Cuban adventure.\n<ol>\n \t<li><strong>Walk on El Malecón:</strong> Fill your lungs with salty, sea air and the day will miraculously take flight. Wander the waterfront filled with poets and fishermen, lovers and daydreamers and take in the delights of Havana in its spectacle of sunlight and sunset.</li>\n \t<li><strong>Old Havana:</strong> Tradition, grandeur and old world charm fill the streets of Old Havana. Your senses come alive with the noise of the city, the scents of the spices and the sounds of life lived. Grab a coffee, sip a mojito, watch for salsa dancers, take in the classic cars and watch as the city ebbs and flows around you.</li>\n \t<li><strong>Salsa Dancing:</strong> Salsa dancing was born in Cuba. Filled with high energy, rhythm, flair and fun, you’ll grab your shoes, take a partner and kick your way to a fabulous evening.</li>\n \t<li><strong>National Capitol:</strong> Built after the post-war sugar boom, this incredible feat of architecture is due to open again as the seat of Cuba’s National Assembly. Once home to the Cuban Congress, CubanAcademy of Science and the National Library of Science and Technology, this large-scale building is visited by locals and tourists daily.</li>\n \t<li><strong>Cristobal Colon Cemetery:</strong> This cemetery has been a central focus in Havana for well over a century. Housing an impromptu outdoor art museum of ‘funeral art,’ there are approximately 175 pieces of art that honor the dead and showcase the artwork simultaneously.</li>\n</ol>\n<img class=\\\"alignnone size-full wp-image-1105\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-rice-beans-plantains.jpg\\\" alt=\\\"El Meson Rice Beans and Plantains\\\" width=\\\"850\\\" height=\\\"500\\\">\n<h3>Top 5 Cuban Dishes To Try</h3>\n<a href=\\\"https://www.elmesondepepe.com/traditional-cuban-cuisine/\\\">Cuban food</a> is one for the ages. No stranger to spice and flavor, Cuban journeys involve more than sightseeing. Here there are state-run restaurants and privately owned paladars particulars amidst street food snacks and tourist fare. Pack your appetite, be sure to try the food and drink of the island and leave your mind and tummy open to new experiences.\n<ol>\n \t<li><strong>Ropa Vieja:</strong> Falling apart is the only similarity that this dish has to its traditional meaning of ‘old clothes’. The shredded beef dish takes great care to simmer in a tomato-based sauce surrounded by green peppers, and sometimes onions.</li>\n \t<li><strong>Tostones:</strong> Deep fried and oozing with yumminess, these twice-fried plantains are smashed into little cakes, fried and arrive in front of you daring you to gobble them whole.</li>\n \t<li><strong>Moros y Cristianos:</strong> In Mexico you find rice and beans, and in Costa Rica, it’s gallo pinto but in Cuba, these stewed black beans and white rice maintain their flavor and stardom while accompanying most dishes.</li>\n \t<li><strong>Mariquitas or Malanga Chips:</strong> The plantain and potato-like taro chips are an easy find and fantastic snack to grab anytime during your day or stay in Cuba.</li>\n \t<li><strong>Milk flan:</strong> Cracking, caramelized goodness makes up this delicious dessert. Although crafted with the simple ingredients of milk, sugar and eggs, you’ll find no better way to end your meal.</li>\n</ol>",
    "modified": "2022-07-19 14:57:32",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1315,
    "author": 3,
    "date": "2017-05-05 19:46:51",
    "title": "Ultimate Guide To The Cuban Sandwich",
    "slug": "ultimate-cuban-sandwich",
    "excerpt": "",
    "content": "<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<p>It’s a debate as old as time. Where did the Cuban sandwich ‘truly’ begin? Who makes the ‘most authentic one’? Where do you go to get one? What may be the best answer to all of these questions is: the one you like the best is the best for you. From Tampa to Miami and <a href=\\\"https://www.elmesondepepe.com/key-west-cuba-history/\\\">Key West to Cuba</a>, the Cuban sandwich has its history in the Cuban culture and the love of heritage is in every <a href=\\\"https://www.elmesondepepe.com/key-west-cuban-food/\\\">bite</a>.<br><!--more--></p>\n<h3>Brief History</h3>\n<p>If the question is ‘where did the Cuban sandwich begin?,’ the answer will depend on whom you direct your question to. Tradition says it’s believed to have been introduced by the Taino tribe in Cuba. With the blending of cultures throughout the country, each group added their own flair to the makings of this delectable creation. Europeans, mainly Spaniards, are known to have introduced the pork and ham to the whole thing.</p>\n<p>Part of the charm of the Cuban sandwich comes from its simplicity. With no vegetables in sight and far better when slathered in butter, the magic between the spiced bread comes with a <a href=\\\"https://www.elmesondepepe.com/traditional-cuban-cuisine/\\\">story of heritage</a>, pedigree and authentic culture. In keeping with tradition, the best sandwich maintains its purity from the top of the first slice to the bottom of the second. There’s a story behind each diagonally sliced bit of goodness, but the debate for leader of the club rages between those from Tampa and those from Miami.</p>\n<p>Those in the first US Cuban community, in Tampa, believe that their ancestors are responsible for the invention of this sacred sandwich. They agree with all of the traditional ingredients; but if you’re from Tampa, your Cuban sandwich has the added element of salami. Those in Miami say different. Miami, the city that believes South Florida – not west Florida – is the Cuban capital of the United States, doesn’t agree with their western counterpart. First, you’d never see salami factor into the likes of a Cuban sandwich and second, the city of Miami swears that theirs is the city that put the likes of the Cuban sandwich on the map.</p>\n<p><img class=\\\"alignnone wp-image-1322 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/05/cuban-sandwich.jpg\\\" alt=\\\"Cuban sandwich\\\" width=\\\"850\\\" height=\\\"500\\\"></p>\n<h3>Why It's So Popular</h3>\n<p>For many reasons, the likes of the authentic dish still thrives today. It’s inexpensive and easy to find. It’s packed with flavorful meats and cheeses, served on crusty herbed bread and is readily available. Locals count on it and travelers look for its deliciousness to add to their hungry bellies and Instagram® feeds.</p>\n<p><strong>Typical Ingredients/Variations</strong></p>\n<ul>\n<li>Slices of mojo (blend of spices like bitter orange, oregano, cumin, garlic, onion, vinegar and salt; citrusy marinade)</li>\n<li>Mild, smoked ham</li>\n<li>Gouda or Swiss cheese</li>\n<li>Pickles</li>\n<li>Mustard</li>\n<li>Cuban bread (including a moist palmetto leaf on top to give it its special flavor)</li>\n<li>Better when rubbed with butter and perfectly pressed (no grill marks necessary)</li>\n<li>Sliced in half diagonally</li>\n</ul>\n<p>Be it from south or west Florida, an authentic Cuban sandwich packs quite a punch. It’s simple to make, it often costs less than $10, it’s sliced diagonally and is always better with butter.</p>\n<p><img class=\\\"alignnone wp-image-1104 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-cuban-sandwich.jpg\\\" alt=\\\"Cuban sandwich\\\" width=\\\"850\\\" height=\\\"500\\\"></p>\n<h3>Pairings</h3>\n<p>Perfect for a snack or lunch on the go, this yummy goodness hits your taste buds, tummy and thirst for a bit of culture. Often paired for a late breakfast or early dinner with the <a href=\\\"https://www.elmesondepepe.com/cuban-coffee-key-west/\\\">traditional drink</a> of café con leche (coffee with milk), the Cuban sandwich manages to cross borders without leaving home.</p>",
    "modified": "2021-08-11 15:12:56",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1293,
    "author": 3,
    "date": "2017-02-10 15:40:02",
    "title": "Best Places for Live Music In Key West",
    "slug": "key-west-live-music",
    "excerpt": "",
    "content": "<b></b><span style=\\\"font-weight: 400;\\\">One of the beauties of Key West is that the island is a haven for live music night and day. From a Duval crawl in the middle of the afternoon to slipping into the Green Parrot for a light night jam session, the island offers endless entertainment. Read on for the best spots in Key West for live music.</span><!--more-->\n\n<img class=\\\"alignnone wp-image-1088 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-de-pepe.jpg\\\" alt=\\\"Full capacity at El Meson De Pepe\\\" width=\\\"850\\\" height=\\\"500\\\" />\n\n<b>El Meson de Pepe\n</b><span style=\\\"font-weight: 400;\\\">Located directly in <a href=\\\"https://www.elmesondepepe.com/things-to-do-mallory-square-key-west/\\\">Mallory Square</a>, the family-owned El Meson de Pepe is the island’s top destination for authentic Cuban food. Order a heaping plate of </span><i><span style=\\\"font-weight: 400;\\\">ropa vieja</span></i><span style=\\\"font-weight: 400;\\\"> with stewed </span><i><span style=\\\"font-weight: 400;\\\">platanos maduros</span></i><span style=\\\"font-weight: 400;\\\">, yellow rice and black beans along with a mojito and you’ll be in heaven. At sunset, El Meson de Pepe gets into the <a href=\\\"https://www.elmesondepepe.com/sunset-celebration-key-west/\\\">Sunset Celebration</a> action in Mallory Square with the only local salsa band on the island. Come samba at sunset to the rhythm of the music and enjoy one of the most beautiful views on the island.</span>\n\n<img class=\\\"alignnone wp-image-1294 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/02/green-parrot-live-music-key-west-e1516201230598.jpg\\\" alt=\\\"Live music on the Green Parrot stage\\\" width=\\\"850\\\" height=\\\"269\\\" />\n\n<b>Green Parrot\n</b><span style=\\\"font-weight: 400;\\\">The Green Parrot is easily Key West’s most beloved bar. Located one block from Duval Street on Whitehead Street, it’s an open air dive bar with a solid live music program. Saturday nights, crowds spill onto the sidewalk for visiting acts like Suenalo or Spam Allstars. Inside, you’ll find a large, central floating bar, as well as a back bar, pool tables, darts and freshly popped popcorn. When the live musicians take a break, it’s also home to the best jukebox on the island. </span>\n\n<b>Smokin’ Tuna\n</b><span style=\\\"font-weight: 400;\\\">Tucked away on a side alley off Duval Street, Smokin’ Tuna has become one of the premier venues on the island for live music. The large outdoor space has multiple bars and a large stage for acts that range from country to rock to folk and blues. They’re also an official sponsor of the Key West Songwriters Festival in May, presenting a stellar lineup during the weeklong event.</span>\n\n<b>Sunset Pier\n</b><span style=\\\"font-weight: 400;\\\">Located at the foot of Ocean Key Resort, Sunset Pier is a colorful tiki bar directly on the water overlooking the Key West Harbor. Perfect for a frozen cocktail at sunset, they’ve also got a great live music lineup to add to the atmosphere. Grab a pastel-painted stool at the bar or a seat along the pier for excellent sunset views. In addition to cocktails, they’ve also got a great bar menu with items like lobster rolls, fish tacos and conch fritters.</span>\n\n<img class=\\\"alignnone wp-image-1295 size-full\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/02/key-west-sloppy-joes.jpg\\\" alt=\\\"Sloppy Joe's Bar in Key West\\\" width=\\\"850\\\" height=\\\"500\\\" />\n\n<b>Sloppy Joe’s\n</b><span style=\\\"font-weight: 400;\\\">Sloppy Joe’s is a classic destination at the foot of Duval Street with a large stage for big acts. It always draws a crowd that gets rowdier as the night goes on. Everything from classic rock to country can be expected at Sloppy’s. There’s a massive bar in the back and an even larger dance floor by the stage, so enjoy the party.</span>\n\n<b>Irish Kevin’s\n</b><span style=\\\"font-weight: 400;\\\">Irish Kevin’s is one of the most raucous bars on Duval Street with a roster of in-house musicians and entertainers who have the secret formula for keeping the energy pumping. Come night or day for a wild party that you’ll definitely be giggling about in the morning. With a full bar set against one wall, the musicians perform on the other side and a large dance floor is in the back. </span>\n\n<b>Durty Harry’s\n</b><span style=\\\"font-weight: 400;\\\">Part of Key West’s largest entertainment complex, Durty Harry’s is an open air venue for live rock music every night. It’s surrounded by seven other bars and venues, so you’ll never run out of places to explore. The complex is best known for Rick’s, an upstairs dance club with a live DJ. You can also chill out at the outdoor Tree Bar overlooking Duval Street.</span>",
    "modified": "2020-05-08 19:32:43",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1285,
    "author": 3,
    "date": "2017-02-06 20:52:53",
    "title": "Where to Find the Best Dessert in Key West",
    "slug": "best-dessert-key-west",
    "excerpt": "",
    "content": "<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<!-- wp:paragraph -->\n<p><span style=\\\"font-weight: 400;\\\">Key lime pie and Key West go hand in hand. While there are plenty of delicious varieties of this creamy, tart dessert, there are also a lot of other sweet treats to tempt your taste buds at restaurants, bakeries and ice cream shops across the island. Read on for where to find the very best desserts in Key West.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:more -->\n<!--more-->\n<!-- /wp:more -->\n\n<!-- wp:paragraph -->\n<p><b>El Meson de Pepe<br></b><span style=\\\"font-weight: 400;\\\">Cuban culture and its food is engrained in Key West’s identity; so take this opportunity to sample the best of Cuba’s </span><i><span style=\\\"font-weight: 400;\\\">dulces.</span></i><span style=\\\"font-weight: 400;\\\"> Head to El Meson de Pepe, a family-owned Cuban restaurant located directly on <a href=\\\"https://www.elmesondepepe.com/things-to-do-mallory-square-key-west/\\\">Mallory Square</a>, and order the </span><i><span style=\\\"font-weight: 400;\\\">tres leches</span></i><span style=\\\"font-weight: 400;\\\">, a moist, indulgent cake made with three different varieties of milk and cream. Guava is a classic ingredient in Cuban desserts, so El Meson’s </span><i><span style=\\\"font-weight: 400;\\\">pudin de guava</span></i><span style=\\\"font-weight: 400;\\\"> (guava bread pudding) is not to be missed. You can also sample both caramel and coconut flan here—and, of course, key lime pie is on the menu. Pair any of these <a href=\\\"https://www.elmesondepepe.com/menu/\\\">sweet treats with a cafecito</a> and you’re in heaven.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1289} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/02/el-meson-de-pepe-cheesecake.jpg\\\" alt=\\\"Cheesecake\\\" class=\\\"wp-image-1289\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><b>Better Than Sex<br></b><span style=\\\"font-weight: 400;\\\">As its name implies, this dessert-only restaurant holds its sweet treats on a lofty pedestal. Dimly lit and bathed in sumptuous red velvet, Better Than Sex is designed for a romantic date night; but it’s just as popular for a girl’s night out. The menu consists of decadent desserts and wines with suggestive names like the Adult Apple, a glass of apple spiced ale whose glass is dipped in caramel, and the eponymous dark chocolate cake made with pumpernickel bread pudding and dark sweet cherries. Helmed by the creative pastry chef-owner Dani Johnson and her husband Len, the menu is constantly changing. Anyone with a sweet tooth will find Better Than Sex impossible to resist. </span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><b>Kermit’s Key Lime Shoppe<br></b><span style=\\\"font-weight: 400;\\\">For a classic slice of key lime pie (or a whole pie to go), head to Kermit’s Key Lime Shoppe on Greene Street. Whether you want yours topped in whipped cream or gussied up with meringue, Kermit’s got you covered. The shop is also home to frozen key lime pie on a stick dipped in chocolate. For a milder variety, try the frozen strawberry key lime pie on a stick dipped in white chocolate. You simply can’t go wrong.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1288} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2017/02/kermits-key-lime-pie-key-west.jpg\\\" alt=\\\"Man holding pie in front of Kermits Key West Key Lime Shoppe\\\" class=\\\"wp-image-1288\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><b>Blue Heaven<br></b><span style=\\\"font-weight: 400;\\\">Blue Heaven is Key West’s most iconic restaurant. Tucked away in the heart of Bahama Village down Petronia Street, Blue Heaven is a delightfully ramshackle restaurant with a large outdoor patio shaded by palm trees and old ship sails. A popular spot for breakfast and brunch, it’s also famously home to some of the best key lime pie on the island. Freshly baked on the premises daily, their key lime pie comes with mile high meringue and a delightfully tart flavor.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><b>A&amp;B Lobster House<br></b><span style=\\\"font-weight: 400;\\\">For an elegant steak or fresh seafood dinner in an old school, clubby setting, A&amp;B Lobster House is a classic Key West destination. Perched on the Historic Seaport with lovely views of the marina, it’s beloved for its preparations of locally caught hogfish, yellowtail snapper and grouper, as well as its prime cuts of beef. It’s also home to one of Key West’s most theatrical desserts. Their award-winning Bananas Foster is flambéed tableside in rum and served in a hazelnut-praline basket with a dollop of banana ice cream. You’ll definitely want to save room for dessert!</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><b>Old Town Bakery<br></b><span style=\\\"font-weight: 400;\\\">For a classic French bakery, look no further than Old Town Bakery. Inside a quaint, cottage on Eaton Street, you’ll find everything from freshly baked baguettes to almond croissants and a menu of fresh, made-to-order sandwiches. Get there early before they run out of their most popular items, like the peach cobbler Danish and the OMG brownie. One taste will seriously leave you saying, OMG!</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><b>Flamingo Crossing Ice Cream<br></b><span style=\\\"font-weight: 400;\\\">For fresh homemade ice cream that you can only get in Key West, head to Flamingo Crossing Ice Cream on upper Duval Street. Sometimes a frozen treat is just what you crave on a hot day in the subtropics. You’ll find ice cream, gelato, non-dairy sorbet and frozen yogurt here. Popular, one-of-a-kind flavors include soursop/guanabana, peaches and cream and raspberry cappuccino; so go ahead and order a couple of scoops.</span></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><b>Glazed Donuts<br></b><span style=\\\"font-weight: 400;\\\">Seriously, is there anything better than a donut—a perfect, soft-as-a-cloud donut covered in a sweet mist of glazed sugar? The answer is, there isn’t! That’s where Key West’s Glazed Donuts comes into play. This gourmet donut shop has way more than the classic glazed donut to fill a baker’s dozen. We’re talking salted caramel cake, blackberry frosted, chocolate, cinnamon sugar and even maple bourbon with candied Canadian bacon.</span></p>\n<!-- /wp:paragraph -->",
    "modified": "2022-03-17 17:21:04",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1201,
    "author": 4,
    "date": "2016-09-16 15:48:34",
    "title": "Complete Guide To Cuban Coffee In Key West",
    "slug": "cuban-coffee-key-west",
    "excerpt": "",
    "content": "<p>Key West is famous for its close proximity to Cuba; the islands are only 90 miles apart. But the two island destinations share more than just geographic proximity. Cuban exiles have found a safe haven in Key West as far back as the late 1800s when they first fought for independence from Spain. Founded in 1871, the San Carlos Institute on Duval Street still stands today as a cultural center and reminder of Key West’s relationship with the Cuban diaspora. One of the best ways to get to the connected heart of the Cuban and Key West cultures is through cuisine, and this is especially easy to do when it comes to Cuban coffee.</p>\n<p><!--more--></p>\n<p><strong>The History of Cuban Coffee</strong><br>\nJose Antonio Gelabert opened the first coffee plant in Cuba in 1748 and production methods were later improved by French colonists at the turn of the century. Coffee production in the 19th and early 20th centuries became a major economic force in Cuba and a defining aspect of the culture. That is, until the Cuban Revolution and Castro’s regime beginning in 1959, at which time coffee production was nationalized. The island produces both Arabica and Robusta beans. While Cuba’s coffee production and exportation may not be what it once was, the <a href=\\\"http://www.elmesondepepe.com/traditional-cuban-cuisine/\\\">cultural heritage</a> of Cuban coffee lives on in Florida cities like Miami, Tampa and Key West.</p>\n<p><strong>Its Flavor Profile</strong><br>\nCuban coffee is strong and sweet—and a little bit goes a long way. It’s more akin to an Italian espresso than American coffee. Made with an espresso machine or a stovetop moka pot, the beverage is often brewed with demerara sugar which infuses sweetness into the strong espresso. Using dark roast beans and hydrolyzed sugar, the coffee takes on a more viscous consistency and can taste as sweet as caramel or a crème brulee—with a kick of strong espresso, of course!</p>\n<p><strong>Varieties of Cuban Coffee</strong></p>\n<ul>\n<li><strong>Café con Leche</strong> -&nbsp;The most popular variety of Cuban coffee in Key West is hands down the café con leche. It’s a blend of Cuban espresso that is stirred into a cup of steamed milk. Once mixed, the traditional morning beverage is similar to a latte.</li>\n<li><strong>Cortadito</strong> -&nbsp;A cortadito literally means “cut with milk.” This is a smaller version of a café con leche with less milk, but just as much espresso.</li>\n<li><strong>Cafecito</strong> -&nbsp;A cafecito is a single shot of Cuban expresso without the steamed milk of a café cone leche. You’ll often see this called a bucci in Key West.</li>\n<li><strong>Colada</strong> -&nbsp;A colada is the same as a cafecito, however this variation is meant for sharing. It’s served in a large Styrofoam cup with a few thimble-sized plastic cups to pour the coffee in and share.</li>\n</ul>\n<p><img class=\\\"alignnone size-full wp-image-1211\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/09/el-meson-de-pepe.jpg\\\" alt=\\\"Decorated interior of El Meson de Pepe showing Cuban heritage\\\" width=\\\"850\\\" height=\\\"500\\\"></p>\n<p><strong>Why People Go Loco For Cuban Coffee</strong><br>\nMaybe it’s the jolt of caffeine. Maybe it’s the sugar rush. Regardless, Cuban coffee is extremely popular in Key West and some people even describe it as addictive. Since it’s hard to get Cuban coffee in other parts of the country, it’s especially novel when you’re visiting Key West. Many people like it for the sheer fact that it’s so different from the American coffee they consume on a regular basis. Take one sip of a steamy, creamy, sweet and strong café con leche and you’ll understand.</p>\n<p><strong>Where to Find Cuban Coffee in Key West</strong></p>\n<ul>\n<li><a href=\\\"http://www.elmesondepepe.com/\\\">El Meson de Pepe</a> -&nbsp;A family owned and operated restaurant in the heart of <a href=\\\"http://www.elmesondepepe.com/things-to-do-mallory-square-key-west/\\\">Mallory Square</a>, you can’t go wrong with a café con leche here.</li>\n<li>Fisherman’s Cafe -&nbsp;Located in the Historic Seaport, this waterfront café serves up locally caught fish sandwiches, Old Key West favorites and, of course, <a href=\\\"https://fishermanscafekeywest.com/\\\">Cuban coffee</a>.</li>\n<li>Five Brother’s Grocery -&nbsp;This classic and historic bodega on Olivia Street is one of the best spots on the island for an authentic Cuban coffee. Order up a side of conch fritters while you’re there.</li>\n<li>Sandy’s Cafe -&nbsp;A coffee counter located on White Street, Sandy’s is another classic spot for Cuban food and coffee on the go.</li>\n<li>Cuban Coffee Queen -&nbsp;With two locations in Old Town, Cuban Coffee Queen offers both classic Cuban coffee and creative choices like frozen and frapped Cuban coffee from its iconic takeaway counter.</li>\n</ul>\n\n<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->",
    "modified": "2022-07-14 20:03:50",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1174,
    "author": 3,
    "date": "2016-03-14 21:27:17",
    "title": "The History of Bacardi Rum",
    "slug": "bacardi-rum-history",
    "excerpt": "",
    "content": "The history of rum tends to be an interesting one because sailors and seafarers favored this strong, sweet spirit during the Age of Exploration. Between amusing accounts of the behaviors of sailors and the effects of alcohol, there are sure to be stories. Its varietals were transported across the world resulting in a wider range of flavor profiles and points of origin than any other spirit. <!--more-->\n\nBacardi is perhaps the most iconic rum in the Americas and is credited with creating such classic <a href=\\\"http://www.elmesondepepe.com/key-west-bar/\\\">cocktails</a> as the Cuba Libre (rum and Coca-Cola) and the daiquiri favored by Ernest Hemingway. Its story dates back to 1862 in Santiago de Cuba and unfolds across the Caribbean and to the United States.\n\n<strong>The Birth of an Icon\n</strong>Founded by Spanish born Facundo Bacardí Massó, whose family immigrated to Cuba when he was 16, he eventually set about refining this spirit. Up until this point it had been made cheaply and was not considered to be a desirable drink. He developed a proprietary strain of yeast giving Bacardi its clean flavor profile, filtered it through charcoal to remove impurities and aged the rum in white oak barrels to mellow it.\nThis resulted in the first clear, or “white,” rum in the world.\n\n<strong>Turbulent Times\n</strong>Facundo eventually opened a small distillery with his brother-in-law, marking the beginning of Bacardi’s history. The years to follow were turbulent times for the citizens of Cuba, with the Cuban War of Independence in the 1880s and 1890s. Facundo’s eldest son, Emilio, was imprisoned and exiled for fighting in the rebel army against Spain. The women of the family were exiled to Jamaica.\n\n<strong>On the Road to Success\n</strong>Starting in 1912, after the United States occupation of Cuba, the company expanded with bottling plants in Barcelona and New York City. When prohibition struck the United States in the 1920s, Cuba became a hotspot for American tourists who could enjoy Bacardi’s rum freely.\n\nBacardi continued to be passed down as a family business through three generations and moved its headquarters to Havana in 1930. The rum’s popularity continued to grow, forever associating Cuba with rum, and Bacardi in particular. It expanded globally to Mexico, Puerto Rico and the United States.\n\n<strong>A Loyal Fan\n</strong>Ernest Hemingway moved to Cuba in 1939 and lived at Finca Vigia in the small town of San Francisco de Paulo, close to Havana. He spent much of his time at the Floridita Bar drinking daiquiris made of Bacardi, His love for this cocktail lead him to immortalize them in his posthumous novel Islands in the Stream. Bacardi is also mentioned in To Have and Have Not, which takes place in Key West, and For Whom the Bell Tolls. Bacardi even through the famous author a party when he won the Nobel Prize in 1954.\n\n<img class=\\\"alignnone size-full wp-image-1178\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/03/el-meson-de-pepe-mojito.jpg\\\" alt=\\\"El Meson Mojito\\\" width=\\\"850\\\" height=\\\"500\\\" />\n\n<strong>Exiled From the Homeland\n</strong>When Fidel Castro’s Cuban Revolution took hold of the island in the 1960s, Bacardi managed to hide its proprietary formula, trademark and assets in the Bahamas. Eventually, it moved its operation to Puerto Rico and Mexico, which proved beneficial in trading with the United States. As a result, Bacardi is not found at bars or grocery stores in Cuba today. The main brand on the island is Havana Club, which Bacardi acquired at one time, and is currently embroiled in a lawsuit with the Cuban government over trademarks and ownership.\n\n<strong>Coming to America\n</strong>In 1964, Bacardi opened its United States headquarters in Miami, Florida inside an eye-catching building designed by exiled Cuban architect Enrique Gutierrez. What makes the exterior of the building so unique are the more thpaxan 28,000 blue and white tiles depicting flowers constructed by Brazilian artist Francisco Brennard. In 2006, Bacardi moved its headquarters from the midtown Miami location to nearby Coral Gables. Today, the building still stands and is commonly referred to as the Bacardi Building.\n\n<strong>Expanding the Portfolio\n</strong>Bacardi is now one of the most recognized and highly consumed rums worldwide. Varieties range from its original white to smooth and mellow gold. The company merged with Martini &amp; Rossi in 1993 and acquired other spirits brands, expanding its portfolio to include Bombay Sapphire, Grey Goose and Dewar’s, amongst others.\n\n<strong>It Runs in the Family\n</strong>It’s a fascinating history of a successful and industrious family business that became a world-renowned brand. At El Meson de Pepe, Bacardi is our rum of choice for <a href=\\\"http://www.elmesondepepe.com/key-west-bar/\\\">signature mojitos</a> and other tropical cocktails. Stop by our <a href=\\\"http://www.elmesondepepe.com/restaurant/\\\">family-owned restaurant</a> for authentic tastes of Cuba.",
    "modified": "2016-12-09 22:53:52",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1160,
    "author": 3,
    "date": "2016-02-15 15:41:29",
    "title": "Things To Do Near Mallory Square Key West",
    "slug": "things-to-do-mallory-square-key-west",
    "excerpt": "",
    "content": "<a href=\\\"https://www.mallorysquare.com/\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">Mallory Square</a> is arguably the center of Key West with all roads leading to its bustling plaza overlooking the Key West Harbor. This is where you’ll find El Meson de Pepe, serving <a href=\\\"http://www.elmesondepepe.com/menu/\\\">authentic Cuban food</a> day and night. It’s also where you’ll find a whole host of other exciting attractions nearby. After you’ve finished a plate of ropa vieja with black beans, yellow rice and sweet plantains and a <a href=\\\"http://www.elmesondepepe.com/key-west-bar/\\\">mojito</a> or two, here are a few things to do near Mallory Square.<!--more-->\n\n<strong>Celebrate the Sunset</strong>\nMallory Square and its nightly <a href=\\\"http://www.elmesondepepe.com/sunset-celebration-key-west/\\\">Sunset Celebration</a> are practically synonymous. Make your way towards Mallory Square an hour before sunset and stroll along the waterfront where street performers, high wire acts, magicians and musicians put on a show before the backdrop of Key West’s world famous sunset. You’ll also find vendors selling conch fritters and mojitos, as well as local craftspeople and artisans with their wares on display.\n\n<img class=\\\"alignnone size-full wp-image-1164\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/02/mallory-square-sunset-celebration.jpg\\\" alt=\\\"Mallory Square Sunset Celebration\\\" width=\\\"850\\\" height=\\\"500\\\">\n\n<strong>Interact With Underwater Creatures</strong>\nThe Key West Aquarium is located directly in Mallory Square and is where you can learn about Key West’s marine ecosystem up close and personal. You have the opportunity to touch such species as sea turtles, nurse sharks and stingrays. The exhibitions are engaging and informative, and a visit here is a must for nature lovers.\n\n<strong>Travel Around by Train</strong>\nHop aboard the <a href=\\\"https://www.conchtourtrain.com/\\\" target=\\\"_blank\\\" rel=\\\"noopener noreferrer\\\">Conch Tour Train</a> at its Mallory Square depot and get whisked away on a 90-minute tour across the island. You’ll learn all about the island’s quirky history, architecture and points of interest. The train’s friendly conductor, who also serves as tour guide, provides a great way to get a lay of the land. While sightseeing aboard the train, take note of which attractions and areas you’d like to revisit.\n\n<img class=\\\"alignnone size-full wp-image-1165\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/02/key-west-conch-tour-train.jpg\\\" alt=\\\"Key West Conch Tour Train\\\" width=\\\"850\\\" height=\\\"500\\\">\n\n<strong>Enjoy the Key West Breeze</strong>\nThe Westin Marina is right next to Mallory Square, home to a lovely promenade of upscale shops and water sports activities. Take a stroll through this area and enjoy the Key West breeze and tropical atmosphere.\n\n<strong>Stroll Through Old Key West</strong>\nOn the other side of Mallory Square is the Historic Seaport. This scenic walk offers a glimpse at Old Key West where you’ll find fishing skiffs, sailboats and mega yachts docked at the marina. You’ll also find iconic drinking establishments like Schooner Wharf and Conch Republic Seafood Company, as well as fine dining restaurants like A&amp;B Lobster House.\n\n<strong>Pick up a Souvenir </strong>\nA small indoor, air-conditioned mall with both shops and vendor kiosks, Clinton Square Market is a great place for souvenir shopping right in Mallory Square. Here, you’ll find great gift ideas, like tanzanite jewelry, local art, baked goods, t-shirts and fashion. Bring home an authentic Key West gift for a loved one, or splurge on a local treasure for yourself.\n\n<strong>Discover Sunken Treasure</strong>\nKey West has a fascinating history in the shipwrecking industry dating back to the 1850s. In fact, it was once the richest city in the United States per capita because of the treasures recovered from wrecked ships along the shallow reef. At the Key West Shipwreck Treasures Museum in Mallory Square, you’ll learn all about this exciting history through artifacts and exhibits. Treasure hunters and inquisitive minds alike will enjoy this attraction!\n\n<img class=\\\"alignnone size-full wp-image-1166\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/02/key-west-shipwreck.jpg\\\" alt=\\\"Key West Shipwreck\\\" width=\\\"850\\\" height=\\\"500\\\">\n\n<strong>Meet the “Sponge Man”</strong>\nAnother lucrative industry in Key West’s early days was sponging and the sponge trade. At the Sponge Market in Mallory Square, you’ll enjoy a “historical” shopping experience featuring the onsite Museum of the Sponge Trade. You can also shop for a wide variety of natural sponges, nautical gifts, art, books and more. Be sure to look for the life-sized “Sponge Man” standing outside the entrance for a unique photo opportunity. You certainly can’t miss him!\n\n<strong>Uncover the Lore of Key West</strong>\nHome to the Key West Museum of Art &amp; History, the Custom House is impossible to miss near Mallory Square because of its prominent, two-story red brick building. Here, you’ll find fascinating exhibits that illuminate the history and lore surrounding Key West. With both permanent and rotating exhibits, highlights include wood paintings of Old Key West by Mario Sanchez and the current exhibit about the history of Key West bars, featuring a replica of the Green Parrot’s façade.",
    "modified": "2022-07-19 15:00:41",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1140,
    "author": 3,
    "date": "2016-01-12 16:52:02",
    "title": "Best Bars in Key West to Explore on Vacation",
    "slug": "best-bars-in-key-west",
    "excerpt": "",
    "content": "Key West is famous for its “anything goes” bar scene and there are quite a few establishments on the island to explore. If you’re looking for something unique, loved by locals and off the beaten path, then read of for the best bars in Key West to visit while on vacation.\n\n<strong>El Meson de Pepe</strong>\nFor a taste of Cuba, look no further than El Meson de Pepe located right in Mallory Square. Swing by this bar after the Sunset Celebration and order a <a href=\\\"http://www.elmesondepepe.com/key-west-bar/\\\">classic mojito</a> made with Bacardi Light Rum, muddled mint leaves, soda water and simple syrup. The festive and cheerful bar is the closest thing you’ll get to <a href=\\\"http://www.elmesondepepe.com/key-west-cuba-history/\\\">Cuba in Key West</a> while still being 90 miles away.\n\n<img class=\\\"alignnone size-full wp-image-1144\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/01/el-meson-de-pepe-bar.jpg\\\" alt=\\\"Cuban beer selection at El Meson de Pepe Bar\\\" width=\\\"850\\\" height=\\\"500\\\">\n\n<strong>The Porch &amp; The Other Side</strong>\nLocated just off Duval Street on Caroline, The Porch and The Other Side are a pair of sibling bars housed under the roof of one sea foam green Victorian mansion. The Porch serves craft beer and fine wines while The Other Side specializes in mixology. For the discerning tippler, this is the place to go for a quality drink. The atmosphere is convivial with a great mix of locals and travelers.\n\n<strong>Waterfront Brewery</strong>\nThe same owner as The Porch and The Other Side recently opened The Waterfront Brewery inside a former grocery store covered in Wyland murals and overlooking the Historic Seaport. Sample a flight of beers brewed on sight in this warehouse-like space. The large space also serves food and hosts musicians for live performances.\n\n<strong>Green Parrot</strong>\nThe Green Parrot is one of Key West’s most iconic and beloved bars. Found on Southard Street just a block off Duval, it’s a brooding biker bar meets tropical oasis. The walls are covered with psychedelic posters and Key West mementos. Order a cold beer and a round of root beer barrels, their proprietary shot made with root beer schnapps and Miller Light, and find your place on the dance floor. The landmark also serves up live music, billiards, darts and free freshly popped popcorn.\n\n<img class=\\\"alignnone size-full wp-image-1145\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/01/green-parrot-bar.jpg\\\" alt=\\\"Exterior of the iconic Green Parrot Bar in Key West\\\" width=\\\"850\\\" height=\\\"500\\\">\n\n<strong>Chart Room at the Pier House</strong>\nYou have to know what you’re looking for to find the Chart Room. This tiny dive bar found at the Pier House Resort is one of Key West’s oldest and saltiest dives. The walls are lined with nautical flags and old photographs and the décor ranges from model ships to old barrels. Order a stiff drink and make yourself at home at this bar where not only popcorn, but also peanuts and hotdogs are free.\n\n<strong>Point Five</strong>\nFor a sophisticated cocktail, head upstairs to Point Five located above the popular Nine One Five restaurant. This speakeasy-style bar is cozy and romantic with polished wood-paneled walls and a wraparound balcony overlooking Duval Street. Great selections of wine and smart cocktails are available, perfect for a relaxing night out with good company.\n\n<strong>Blue Heaven</strong>\nLocated in the heart of Key West’s Bahama Village, Blue Heaven is a classic island establishment. Famous for its brunch and laid-back ambiance, it also has a great outdoor bar in its own right perfect for idling away the afternoon or evening. With an expansive backyard that features live music, chickens roaming freely and a ping pong table, it’s a lovely, ramshackle place perfect for sipping a Bloody Mary or a spiked lemonade.",
    "modified": "2022-07-19 15:03:14",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1123,
    "author": 3,
    "date": "2016-01-04 22:05:07",
    "title": "Traditional Cuban Food During The Holidays",
    "slug": "cuban-food-during-holidays",
    "excerpt": "",
    "content": "<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<!-- wp:paragraph -->\n<p>So much of <a href=\\\"http://www.elmesondepepe.com/key-west-cuba-history/\\\">Cuban culture</a> is relayed through <a href=\\\"http://www.elmesondepepe.com/traditional-cuban-cuisine/\\\">its cuisine</a>, and the holidays are an incredible time to feast on traditional fare with family and friends. As opposed to roasted turkey or honey ham, the centerpiece to any Cuban holiday meal is the whole roasted pig. And instead of stuffing and yams, Cubans delight in black beans and rice and garlicky yuca. Read on for a full menu of traditional <a href=\\\"http://www.elmesondepepe.com/menu/\\\">Cuban food</a> during the holidays with all the trimmings.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>To Drink</strong><br><a href=\\\"http://www.elmesondepepe.com/key-west-bar/\\\">Mojitos</a> – This classic white rum drink is made with muddled mint and sugar cane.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Crema de Vie – This is the Cuban version of eggnog and is made with condensed milk, rum and sugar.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Spanish Cider – Whether it’s sparkling or flat, alcoholic or virgin, Spanish cider (or <em>sidra</em>) is a must during the holidays.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1129} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/01/el-meson-mojito.png\\\" alt=\\\"El Meson Mojito\\\" class=\\\"wp-image-1129\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>Appetizer</strong><br>Croquetas – Made with pollo or jamon, these crispy fried potato dumplings make for mouth-watering appetizers before the main course.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Main Course</strong><br>Whole Roasted Pig – The roasted pig is a huge part of Cuban holidays and special occasions. It’s traditional to purchase a whole pig from the butcher to roast in the backyard in a caja china roasting box. Alternatively, smaller suckling pig is the perfect size to feed a smaller family.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Side Dishes</strong><br>Black beans and rice – Also called <em>moros y cristianos</em>, no Cuban meal is complete without a generous helping of black beans and rice.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Tostones – Tostones are savory fried plantains that can be dipped in various sauces for an absolutely scrumptious side dish.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Yuca con Mojo – Yuca is a root vegetable and a staple in the Cuban diet. They’re delicious sautéed in garlic and other savory sauces.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"id\\\":1130} -->\n<figure class=\\\"wp-block-image\\\"><img src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2016/01/el-meson-side-dishes.png\\\" alt=\\\"El Meson Side Dishes\\\" class=\\\"wp-image-1130\\\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>Desserts</strong><br>Arroz con Leche – Cuban rice pudding is a traditional way to end a holiday meal on a sweet note.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><em>Buñuelos</em> – These are Cuban pastries enjoyed at Christmastime. They can best be described as a cross between a doughnut and a beignet with a Cuban twist. And don’t forget to sprinkle them in powdered sugar.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Cake de Ron – A spongy rum cake is also a traditional sweet treat at any Cuban holiday feast.</p>\n<!-- /wp:paragraph -->",
    "modified": "2022-03-17 17:26:31",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1098,
    "author": 4,
    "date": "2015-11-24 17:40:40",
    "title": "The Flavors and Heritage of Traditional Cuban Cuisine",
    "slug": "traditional-cuban-cuisine",
    "excerpt": "",
    "content": "<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<!-- wp:paragraph -->\n<p>Key West is famously only 90 miles from Cuba, and the two islands share more than just geographical proximity. Cuban exiles have found a safe haven in Key West since the late 1800s when they first fought for independence from Spain. The San Carlos Institute on Duval Street, founded in 1871 and visited by beloved poet and revolutionary Jose Martí, still stands today as a cultural center and reminder of Key West’s <a href=\\\"http://www.elmesondepepe.com/key-west-cuba-history/\\\">relationship</a> with the Cuban diaspora.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Of course, one of the best ways to get to the heart of a culture is through its cuisine. And this is especially easy (and enjoyable) with rich and flavorful Cuban food whose influence is felt in the most subtle ways throughout Key West. Whether it’s a café con leche with Cuban cheese toast for breakfast or a <a href=\\\"http://www.elmesondepepe.com/key-west-bar/\\\">mojito at happy hour</a>, Cuban food is engrained in the daily culture of island life.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>At El Meson de Pepe, Chef Pepe Diaz has been honoring the unique <a href=\\\"http://www.elmesondepepe.com/restaurant/\\\">Cuban-Conch heritage</a> through his food since <a href=\\\"http://www.elmesondepepe.com/historic-restaurants-in-key-west/\\\">1985</a>. To understand the roots, flavors and heritage of this delicious cuisine, read on for an explanation of some of the most popular ingredients and dishes on <a href=\\\"http://www.elmesondepepe.com/menu/\\\">our menu</a>.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Rice, Beans &amp; Plantains</strong><br>Like the origins of most native cuisine, ingredients are often determined by what’s abundant and available. In Cuba, rice and beans offer sustenance and comfort as a side dish to almost every meal. It’s typically prepared as black beans and white&nbsp;rice in hearty portions. Some dishes require other ingredients, like arroz con pollo or rice with chicken.&nbsp;Plantains are another Cuban staple. Similar in texture and taste to a banana, they can be prepared fried and salty, called tostones, or stewed and sweet. A popular starter is tostones rellenos, which are fried plantains stuffed with anything from garlic shrimp to spicy beef.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"align\\\":\\\"center\\\",\\\"id\\\":1105,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<figure class=\\\"wp-block-image aligncenter\\\"><a href=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-rice-beans-plantains.jpg\\\"><img src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-rice-beans-plantains.jpg\\\" alt=\\\"El Meson Rice Beans and Plantains\\\" class=\\\"wp-image-1105\\\"/></a></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>Mojo Criollo</strong><br>Cuban cuisine also represents the melding pot of the island’s Spanish to African influences. This is no more apparent than in its sauces and spices. Mojo criollo is a popular sauce prepared with anything from chicken to pork, typically made with garlic, oil and sour&nbsp;orange juice.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Ropa Vieja</strong><br>One of the most popular entrees in Cuban cuisine is <a href=\\\"http://www.elmesondepepe.com/key-west-cuban-food/\\\">ropa vieja</a>. This stewed shredded beef dish is slow cooked in fresh tomatoes, onions, peppers, garlic and wine to create a mouthwatering meal. And following its origins, the dish is accompanied by white&nbsp;rice, black beans and sweet plantains.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Pescado, Gambas y Camarones</strong><br>With both Cuba and Key West surrounded by the sea, it’s only natural that seafood is a staple of Cuban food here. Whether it’s a mahi-mahi filet marinated in Cuban criollo sauce or shrimp drowning in a garlic and wine sauce, fresh fish is definitely on the menu.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For your reference when perusing menus, pescado means fish, camarones is shrimp and gambas refers to jumbo shrimp typically served in their shells.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"align\\\":\\\"center\\\",\\\"id\\\":1103,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<figure class=\\\"wp-block-image aligncenter\\\"><a href=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-cuban-cuisine.jpg\\\"><img src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-cuban-cuisine.jpg\\\" alt=\\\"El Meson Cuban Cuisine\\\" class=\\\"wp-image-1103\\\"/></a></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>Cuban Mix Sandwich, Cuban Toast &amp; Pork</strong><br>Talk about a true Cuban classic. The Cuban mix sandwich is a staple of this cuisine. Made with roast pork, ham, Swiss cheese, pickles and mustard pressed on crispy Cuban bread, it’s a satisfying sandwich loved by many.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The two most important ingredients of the Cuban sandwich are the pork, which is a staple of the Cuban diet, and the crusty Cuban bread. Similar to a French baguette, yet more light and fluffy, this style of bread is made with a small amount of lard for texture.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"align\\\":\\\"center\\\",\\\"id\\\":1104,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<figure class=\\\"wp-block-image aligncenter\\\"><a href=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-cuban-sandwich.jpg\\\"><img src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-cuban-sandwich.jpg\\\" alt=\\\"El Meson Cuban Sandwich\\\" class=\\\"wp-image-1104\\\"/></a></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>Cuban Coffee</strong><br>If you haven’t tried Cuban coffee yet, you don’t know what you’re missing. This strong, sweet coffee is consumed with milk (con leche) or on its own as a bucci or colada.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Rum</strong><br>Made from the sugar cane that grows abundantly in Cuba, rum is a tradition deep seated in Cuban culture. From <a href=\\\"http://www.elmesondepepe.com/key-west-bar/\\\">mojitos</a> prepared with muddled mint leaves and sugar to rum punch with a combination of tropical fruit juices and the daiquiris that Hemingway famously guzzled at the Floridita Bar in Havana, these libations are enjoyed in abundance in Key West today.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\\\"align\\\":\\\"center\\\",\\\"id\\\":1101,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<figure class=\\\"wp-block-image aligncenter\\\"><a href=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-mojito.jpg\\\"><img src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-mojito.jpg\\\" alt=\\\"El Meson Mojito\\\" class=\\\"wp-image-1101\\\"/></a></figure>\n<!-- /wp:image -->",
    "modified": "2022-07-27 18:55:43",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 1082,
    "author": 4,
    "date": "2015-10-28 13:42:04",
    "title": "Most Historic Restaurants In Key West",
    "slug": "historic-restaurants-in-key-west",
    "excerpt": "",
    "content": "<!-- wp:paragraph -->\n<p>Part of Key West’s charm is its colorful history and quirky characters who’ve shaped the island into what it is today. Get a taste of the past at Key West’s most historic and iconic restaurants.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Pepe’s Café, 1909</strong><br>Pepe’s, founded in 1909, is the oldest restaurant still operating in Key West today. Locals and visitors love it precisely for that, its Old Florida charm set in a cozy backyard on Caroline Street. But that’s not the only draw; the food is as close as it gets to Florida home cooking. Breakfast is popular here with massive omelet and French toast specials, plus hand-squeezed orange juice makes screwdrivers or mimosas incredibly refreshing. Lunch and dinnertime calls for grilled mahi sandwiches or grouper specials.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Sloppy Joe’s, 1933</strong><br>Sloppy Joe’s is one of the most storied restaurants on the island. Today, it’s famous for raucous parties, live music and late nights on Duval Street. But this bar actually originated in 1933 around the corner on Green Street in a space currently occupied by Captain Tony’s Saloon. This was where Ernest Hemingway spent many evenings after fishing on his beloved boat Pilar. When owner Joe Russell moved his bar to Duval Street in 1937, Hemingway carried one of the urinals from the Green Street location back to his home on Whitehead Street and turned it into a fountain, which you can still see on a tour of the home. Today, Sloppy Joe’s is a great spot for lunch with live music. And for even more entertainment, catch the annual Hemingway lookalike contest every January.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>A&amp;B Lobster House, 1947</strong><br>One of Key West’s top fine dining restaurants is also one of the most historic. A&amp;B Lobster House looks out on the Historic Seaport from a second floor perch with a lovely balcony. A white tablecloth establishment, diners love A&amp;B for steak, lobster, fresh caught seafood, a spectacular wine list and perfectly mixed martinis.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Two Friends Patio Restaurant, 1967</strong><br>Founded in 1967, Two Friends Patio Restaurant is a casual, family-owned open-air spot on a sprawling patio on Front Street. The mood is relaxed and easygoing in a location where you can watch the world pass by on the sidewalk outside. Two Friends serves fresh seafood, like local shrimp, fish, lobster, oysters, conch and crab. They also have a great menu of steaks and delicious frozen drinks to wash it all down.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Louie’s Backyard, 1971</strong><br>Louie’s Backyard is another classic Key West restaurant with some of the best food on the island and one of the loveliest settings. Off the beaten path on the Atlantic Ocean side, Louie’s is set in a historic Victorian mansion with a beautiful tiered deck leading down to the water. The menu at Louie’s is a creative, upscale twist on Floribbean fare, like miso-glazed yellowfin tuna or grilled swordfish with olives and fennel salad. Come for sunset cocktails at the After Deck bar on the water or try the Upper Deck upstairs for lighter tapas-style fare.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Half Shell Raw Bar, 1972</strong><br>A mainstay at the Historic Seaport since 1972, Half Shell Raw Bar is a down-to-earth, open-air spot filled with picnic tables, and buckets of oysters, clams, peel-n-eat shrimp, crab legs and mussels waiting to be shucked. For anyone craving fresh raw bar fare in a laidback setting with water views, Half Shell is the place to go.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>El Meson de Pepe, 1985</strong><br>Of course, Key West’s ties to Cuba run deep and classic Cuban fare can be found at El Meson de Pepe right in Mallory Square. Our restaurant first opened in 1985 on upper Duval Street and then made a move to its current location in 1997. From a Cuban mix sandwich to ropa vieja with black beans and rice, El Meson de Pepe is the place for <a href=\\\"http://www.elmesondepepe.com/menu/\\\">authentic Cuban cuisine</a>. Don’t forget to try the <a href=\\\"http://www.elmesondepepe.com/key-west-bar/\\\">mojitos</a>!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<!-- wp:image {\\\"align\\\":\\\"center\\\",\\\"id\\\":1088,\\\"linkDestination\\\":\\\"custom\\\"} -->\n<figure class=\\\"wp-block-image aligncenter\\\"><a href=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-de-pepe.jpg\\\"><img src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2015/10/el-meson-de-pepe.jpg\\\" alt=\\\"Image of Indoor Dining Area\\\" class=\\\"wp-image-1088\\\"/></a></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p><strong>Hog’s Breath, 1988</strong><br>Check out this unique Key West restaurant complete with live music and delicious bar food for a rocking good time. As they say, Hog’s Breath is better than no breath at all! This funky indoor-outdoor bar-restaurant is decked out with license plates lining the walls and a rowdy scene. Whether its’ the world famous hog dog or one of the best rum punches on the island, you’re guaranteed to have a good time at Hog’s Breath. You’ll also find some of the best musicians on the island here.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Blue Heaven, 1992</strong><br>Blue Heaven is a Key West modern classic. Founded in 1992 by Suanne and Richard Hatch in Bahama Village, the place really is a little slice of heaven. Expect a wait of at least an hour for weekend brunch as this place doesn’t take reservations. The wait is worth it though for banana pancakes, lobster eggs benedicts and the best Bloody Mary’s on the island. The backyard setting with an eclectic assortment of painted wooden tables shaded by palm trees and ship’s sails is positively dreamy. There’s a free-standing bar, ping-pong tables and often live music for entertainment. Dinner is delicious with jerk chicken and Caribbean BBQ shrimp, and don’t forget to order a slice of key lime pie with mile high merengue for dessert.</p>\n<!-- /wp:paragraph -->",
    "modified": "2022-07-19 15:44:52",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  },
  {
    "id": 766,
    "author": 5,
    "date": "2015-05-05 20:57:08",
    "title": "More Than A Cuban Sandwich: Key West Food You Must Try",
    "slug": "key-west-cuban-food",
    "excerpt": "",
    "content": "<!-- wp:html -->\n<h2 style=\\\"margin-top:0;\\\">Sign Up &amp; Receive 10%* Off</h2>\n<!-- /wp:html -->\n\n<!-- wp:gravityforms/form {\\\"formId\\\":\\\"7\\\",\\\"title\\\":false} /-->\n\n<!-- wp:paragraph -->\n<p>A fusion of Native American Taino food, Spanish, African and Caribbean cooking, Cuban cuisine has been a staple on the island of Key West for over a century. Being located so close to Cuba has naturally influenced the local restaurants to cook with traditional flavors and ingredients. Planning to sample a variety of entrees should be at the forefront of every Key West vacation itinerary. We’ve compiled a list of favorites gathered from locals and visitors that you should definitely consider.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:shortcode -->\n[row cols_nr=\\\"2\\\"]\n\n[col size=\\\"4\\\"]\n\n<img class=\\\"alignnone size-medium wp-image-971\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/05/key-west-cuban-sandwich-300x300.jpg\\\" alt=\\\"Cuban Sandwich with Plantain Chips\\\" width=\\\"300\\\" height=\\\"300\\\">\n\n[/col]\n\n[col size=\\\"8\\\"]\n\n<strong>LUNCH\n</strong>\n\n<strong>Pan Con Ropa Vieja-</strong>&nbsp;sandwich with shredded beef marinated in creole sauce\n<span style=\\\"line-height: 1.5;\\\"><strong>Emparedado de Pollo-&nbsp;</strong>mojo marinated grilled chicken sandwich\n</span><span style=\\\"line-height: 1.5;\\\"><strong>Cayo Hueso Cuban Mix-&nbsp;</strong>sugar glazed ham, roast pork, Swiss cheese and all of the fixings, a traditional Cuban sandwich with a Key West twist.</span>\n\n[/col]\n\n[/row]\n<!-- /wp:shortcode -->\n\n<!-- wp:shortcode -->\n[row cols_nr=\\\"2\\\"]\n\n[col size=\\\"4\\\"]\n\n<img class=\\\"alignnone size-medium wp-image-972\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2023/01/cuban-nachos-2023.jpg\\\" alt=\\\"Cuban Nachos\\\" width=\\\"300\\\" height=\\\"300\\\">\n\n[/col]\n\n[col size=\\\"8\\\"]\n\n<strong>TAPAS</strong>\n\n<strong>Frituras de Cobo-</strong> corn meal fritters with cracked conch\n<strong>Antojitos-</strong> fried cheese and chorizo over plantain chips\n<strong>Camarones de Coco-</strong> fried coconut shrimp with pineapple marmalade\n<strong>Masitas de Cero Frita-</strong> marinated pork cubes golden fried with onions and parsley\n<strong>Cuban Nachos-</strong> homemade plantain chips topped w/Ropa Vieja, Picadillo, Guacamole, cheese, diced tomatoes, and onions\n\n[/col]\n\n[/row]\n<!-- /wp:shortcode -->\n\n<!-- wp:shortcode -->\n[row cols_nr=\\\"2\\\"]\n\n[col size=\\\"4\\\"]\n\n<img class=\\\"alignnone size-medium wp-image-973\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/05/vaca-frita-300x300.jpg\\\" alt=\\\"Vaca Frita with Plantains and Rice\\\" width=\\\"300\\\" height=\\\"300\\\">\n\n[/col]\n\n[col size=\\\"8\\\"]\n\n<strong>DINNER</strong>\n\n<strong>Rabirubia Frita Entera-</strong> fried whole yellowtail with fresh key lime, garlic and onions Churrasco- grilled skirt steak with a tangy chimichurri sauce\n<strong>Vaca Frita-</strong> shredded flank meat with garlic, lime, and onions\n<strong>Lechon Asado-</strong> traditional roasted pork marinated in cumin-mojo sauce\n\n[/col]\n\n[/row]\n<!-- /wp:shortcode -->\n\n<!-- wp:shortcode -->\n[row cols_nr=\\\"2\\\"]\n\n[col size=\\\"4\\\"]\n\n<img class=\\\"alignnone size-medium wp-image-973\\\" src=\\\"https://www.elmesondepepe.com/wp-content/uploads/2022/03/flan-casero.jpg\\\" alt=\\\"the dessert flan casero\\\" width=\\\"300\\\" height=\\\"300\\\">\n\n[/col]\n\n[col size=\\\"8\\\"]\n\n<strong>DESSERT</strong>\n\n<strong>Pudin de Guava-</strong> Guava Bread Pudding\n<strong>Flan Casero-</strong> Caramel Custard Flan\n<strong>Tres Leches-</strong> Three Milk Cake Sensation\n<strong>Flan de Coco-</strong> Coconut Flan\n[/col]\n\n[/row]\n<!-- /wp:shortcode -->\n\n<!-- wp:shortcode -->\n[row cols_nr=\\\"2\\\"]\n\n[col size=\\\"4\\\"]\n\n<img class=\\\"alignnone size-medium wp-image-974\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/05/sangria-300x300.jpg\\\" alt=\\\"Red Sangria\\\" width=\\\"300\\\" height=\\\"300\\\">\n\n[/col]\n\n[col size=\\\"8\\\"]\n\n<strong>COCKTAILS</strong>\n\n<strong>Mojito-</strong> muddled lime and mint with light rum, bitters, sugar, and club soda.\n<strong>Caipirnhia-</strong> fresh lime and sugar mixed with Cahcaca\n<strong>Cuba Libre-</strong> Old Havana rum with cola and lime\n<strong>Rum Runner-</strong> Blend of rums, juices, banana and blackberry brandy\n<strong>Homemade Sangria-</strong> Blend of wine, sugar, and assorted fruit\n\n[/col]\n\n[/row]\n<!-- /wp:shortcode -->\n\n<!-- wp:shortcode -->\n[row cols_nr=\\\"2\\\"]\n\n[col size=\\\"4\\\"]\n\n<img class=\\\"alignnone size-medium wp-image-975\\\" src=\\\"http://www.elmesondepepe.com/wp-content/uploads/2015/05/key-west-cuban-coffee-300x300.jpg\\\" alt=\\\"Cuban Coffee\\\" width=\\\"300\\\" height=\\\"300\\\">\n\n[/col]\n\n[col size=\\\"8\\\"]\n\n<strong>CUBAN COFFEE</strong>\n\n<strong>Café Con Leche-</strong> Cuban coffee with milk and sugar\n<strong>Cortadito-</strong> Cuban espresso with steamed milk\n<strong>Colada-</strong> Large glass of Cuban espresso with sugar (enough to share)\n\n[/col]\n\n[/row]\n<!-- /wp:shortcode -->\n\n<!-- wp:paragraph -->\n<p>After spending a few days in Key West, you’ll know why the island is considered one of the best places in America for Cuban cuisine. There’s a food truck, shack, or casual restaurant serving up great Cuban food throughout the island. When you’re near Mallory Square, be sure to stop by El Meson de Pepe and try one of these Cuban favorites with your friends and family.</p>\n<!-- /wp:paragraph -->",
    "modified": "2023-01-24 13:32:09",
    "postType": "post",
    "postStatus": "publish",
    "parent": 0
  }
]